// third_party/blink/public/mojom/dom_storage/storage_area.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_DOM_STORAGE_STORAGE_AREA_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_DOM_STORAGE_STORAGE_AREA_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageAreaObserver_KeyChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageAreaObserver_KeyChanged_Params_Data));
      new (data()) StorageAreaObserver_KeyChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageAreaObserver_KeyChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageAreaObserver_KeyChanged_Params_Data>(index_);
    }
    StorageAreaObserver_KeyChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> new_value;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> old_value;
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageAreaObserver_KeyChanged_Params_Data();
  ~StorageAreaObserver_KeyChanged_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyChanged_Params_Data) == 40,
              "Bad sizeof(StorageAreaObserver_KeyChanged_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageAreaObserver_KeyChangeFailed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageAreaObserver_KeyChangeFailed_Params_Data));
      new (data()) StorageAreaObserver_KeyChangeFailed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageAreaObserver_KeyChangeFailed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageAreaObserver_KeyChangeFailed_Params_Data>(index_);
    }
    StorageAreaObserver_KeyChangeFailed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageAreaObserver_KeyChangeFailed_Params_Data();
  ~StorageAreaObserver_KeyChangeFailed_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyChangeFailed_Params_Data) == 24,
              "Bad sizeof(StorageAreaObserver_KeyChangeFailed_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageAreaObserver_KeyDeleted_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageAreaObserver_KeyDeleted_Params_Data));
      new (data()) StorageAreaObserver_KeyDeleted_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageAreaObserver_KeyDeleted_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageAreaObserver_KeyDeleted_Params_Data>(index_);
    }
    StorageAreaObserver_KeyDeleted_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> old_value;
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageAreaObserver_KeyDeleted_Params_Data();
  ~StorageAreaObserver_KeyDeleted_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyDeleted_Params_Data) == 32,
              "Bad sizeof(StorageAreaObserver_KeyDeleted_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageAreaObserver_AllDeleted_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageAreaObserver_AllDeleted_Params_Data));
      new (data()) StorageAreaObserver_AllDeleted_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageAreaObserver_AllDeleted_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageAreaObserver_AllDeleted_Params_Data>(index_);
    }
    StorageAreaObserver_AllDeleted_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t was_nonempty : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageAreaObserver_AllDeleted_Params_Data();
  ~StorageAreaObserver_AllDeleted_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_AllDeleted_Params_Data) == 24,
              "Bad sizeof(StorageAreaObserver_AllDeleted_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data));
      new (data()) StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data>(index_);
    }
    StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t value : 1;
  uint8_t padfinal_[7];

 private:
  StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data();
  ~StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data) == 16,
              "Bad sizeof(StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_AddObserver_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_AddObserver_Params_Data));
      new (data()) StorageArea_AddObserver_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_AddObserver_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_AddObserver_Params_Data>(index_);
    }
    StorageArea_AddObserver_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data observer;

 private:
  StorageArea_AddObserver_Params_Data();
  ~StorageArea_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_AddObserver_Params_Data) == 16,
              "Bad sizeof(StorageArea_AddObserver_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Put_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Put_Params_Data));
      new (data()) StorageArea_Put_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Put_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Put_Params_Data>(index_);
    }
    StorageArea_Put_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> client_old_value;
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageArea_Put_Params_Data();
  ~StorageArea_Put_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Put_Params_Data) == 40,
              "Bad sizeof(StorageArea_Put_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Put_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Put_ResponseParams_Data));
      new (data()) StorageArea_Put_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Put_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Put_ResponseParams_Data>(index_);
    }
    StorageArea_Put_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  StorageArea_Put_ResponseParams_Data();
  ~StorageArea_Put_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Put_ResponseParams_Data) == 16,
              "Bad sizeof(StorageArea_Put_ResponseParams_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Delete_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Delete_Params_Data));
      new (data()) StorageArea_Delete_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Delete_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Delete_Params_Data>(index_);
    }
    StorageArea_Delete_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> client_old_value;
  mojo::internal::Pointer<mojo::internal::String_Data> source;

 private:
  StorageArea_Delete_Params_Data();
  ~StorageArea_Delete_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Delete_Params_Data) == 32,
              "Bad sizeof(StorageArea_Delete_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Delete_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Delete_ResponseParams_Data));
      new (data()) StorageArea_Delete_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Delete_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Delete_ResponseParams_Data>(index_);
    }
    StorageArea_Delete_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  StorageArea_Delete_ResponseParams_Data();
  ~StorageArea_Delete_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Delete_ResponseParams_Data) == 16,
              "Bad sizeof(StorageArea_Delete_ResponseParams_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_DeleteAll_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_DeleteAll_Params_Data));
      new (data()) StorageArea_DeleteAll_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_DeleteAll_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_DeleteAll_Params_Data>(index_);
    }
    StorageArea_DeleteAll_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> source;
  mojo::internal::Interface_Data new_observer;

 private:
  StorageArea_DeleteAll_Params_Data();
  ~StorageArea_DeleteAll_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_DeleteAll_Params_Data) == 24,
              "Bad sizeof(StorageArea_DeleteAll_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_DeleteAll_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_DeleteAll_ResponseParams_Data));
      new (data()) StorageArea_DeleteAll_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_DeleteAll_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_DeleteAll_ResponseParams_Data>(index_);
    }
    StorageArea_DeleteAll_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  StorageArea_DeleteAll_ResponseParams_Data();
  ~StorageArea_DeleteAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_DeleteAll_ResponseParams_Data) == 16,
              "Bad sizeof(StorageArea_DeleteAll_ResponseParams_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Get_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Get_Params_Data));
      new (data()) StorageArea_Get_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Get_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Get_Params_Data>(index_);
    }
    StorageArea_Get_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;

 private:
  StorageArea_Get_Params_Data();
  ~StorageArea_Get_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Get_Params_Data) == 16,
              "Bad sizeof(StorageArea_Get_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_Get_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_Get_ResponseParams_Data));
      new (data()) StorageArea_Get_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_Get_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_Get_ResponseParams_Data>(index_);
    }
    StorageArea_Get_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t pad0_[7];
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

 private:
  StorageArea_Get_ResponseParams_Data();
  ~StorageArea_Get_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Get_ResponseParams_Data) == 24,
              "Bad sizeof(StorageArea_Get_ResponseParams_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_GetAll_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_GetAll_Params_Data));
      new (data()) StorageArea_GetAll_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_GetAll_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_GetAll_Params_Data>(index_);
    }
    StorageArea_GetAll_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data new_observer;

 private:
  StorageArea_GetAll_Params_Data();
  ~StorageArea_GetAll_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_GetAll_Params_Data) == 16,
              "Bad sizeof(StorageArea_GetAll_Params_Data)");
class COMPONENT_EXPORT(DOM_STORAGE_MOJOM_SHARED) StorageArea_GetAll_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(StorageArea_GetAll_ResponseParams_Data));
      new (data()) StorageArea_GetAll_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    StorageArea_GetAll_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<StorageArea_GetAll_ResponseParams_Data>(index_);
    }
    StorageArea_GetAll_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::KeyValue_Data>>> data;

 private:
  StorageArea_GetAll_ResponseParams_Data();
  ~StorageArea_GetAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_GetAll_ResponseParams_Data) == 16,
              "Bad sizeof(StorageArea_GetAll_ResponseParams_Data)");

}  // namespace internal
class StorageAreaObserver_KeyChanged_ParamsDataView {
 public:
  StorageAreaObserver_KeyChanged_ParamsDataView() {}

  StorageAreaObserver_KeyChanged_ParamsDataView(
      internal::StorageAreaObserver_KeyChanged_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetKeyDataView(
      mojo::ArrayDataView<uint8_t>* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadKey(UserType* output) {
    auto* pointer = data_->key.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<uint8_t>>(
        pointer, output, context_);
  }
  inline void GetNewValueDataView(
      mojo::ArrayDataView<uint8_t>* output);

  template <typename UserType>
