// services/network/public/mojom/network_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace network {
namespace mojom {
namespace internal {
class  NetworkServiceClient_OnLoadingStateUpdate_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnLoadingStateUpdate_Params_Data));
      new (data()) NetworkServiceClient_OnLoadingStateUpdate_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnLoadingStateUpdate_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnLoadingStateUpdate_Params_Data>(index_);
    }
    NetworkServiceClient_OnLoadingStateUpdate_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::LoadInfo_Data>>> infos;

 private:
  NetworkServiceClient_OnLoadingStateUpdate_Params_Data();
  ~NetworkServiceClient_OnLoadingStateUpdate_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnLoadingStateUpdate_Params_Data) == 16,
              "Bad sizeof(NetworkServiceClient_OnLoadingStateUpdate_Params_Data)");
class  NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data));
      new (data()) NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data>(index_);
    }
    NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data();
  ~NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkServiceClient_OnLoadingStateUpdate_ResponseParams_Data)");
class  NetworkServiceClient_OnDataUseUpdate_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnDataUseUpdate_Params_Data));
      new (data()) NetworkServiceClient_OnDataUseUpdate_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnDataUseUpdate_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnDataUseUpdate_Params_Data>(index_);
    }
    NetworkServiceClient_OnDataUseUpdate_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t network_traffic_annotation_id_hash;
  uint8_t pad0_[4];
  int64_t recv_bytes;
  int64_t sent_bytes;

 private:
  NetworkServiceClient_OnDataUseUpdate_Params_Data();
  ~NetworkServiceClient_OnDataUseUpdate_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnDataUseUpdate_Params_Data) == 32,
              "Bad sizeof(NetworkServiceClient_OnDataUseUpdate_Params_Data)");
class  NetworkServiceClient_OnRawRequest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnRawRequest_Params_Data));
      new (data()) NetworkServiceClient_OnRawRequest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnRawRequest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnRawRequest_Params_Data>(index_);
    }
    NetworkServiceClient_OnRawRequest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t routing_id;
  mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieWithAccessResult_Data>>> cookies_with_access_result;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpRawHeaderPair_Data>>> headers;

 private:
  NetworkServiceClient_OnRawRequest_Params_Data();
  ~NetworkServiceClient_OnRawRequest_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnRawRequest_Params_Data) == 40,
              "Bad sizeof(NetworkServiceClient_OnRawRequest_Params_Data)");
class  NetworkServiceClient_OnRawResponse_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnRawResponse_Params_Data));
      new (data()) NetworkServiceClient_OnRawResponse_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnRawResponse_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnRawResponse_Params_Data>(index_);
    }
    NetworkServiceClient_OnRawResponse_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t routing_id;
  mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieAndLineWithStatus_Data>>> cookies_with_status;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpRawHeaderPair_Data>>> headers;
  mojo::internal::Pointer<mojo::internal::String_Data> raw_response_headers;

 private:
  NetworkServiceClient_OnRawResponse_Params_Data();
  ~NetworkServiceClient_OnRawResponse_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnRawResponse_Params_Data) == 48,
              "Bad sizeof(NetworkServiceClient_OnRawResponse_Params_Data)");
class  NetworkServiceClient_OnCorsPreflightRequest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnCorsPreflightRequest_Params_Data));
      new (data()) NetworkServiceClient_OnCorsPreflightRequest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnCorsPreflightRequest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnCorsPreflightRequest_Params_Data>(index_);
    }
    NetworkServiceClient_OnCorsPreflightRequest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t render_frame_id;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
  mojo::internal::Pointer<::network::mojom::internal::URLRequest_Data> request;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> initiator_url;

 private:
  NetworkServiceClient_OnCorsPreflightRequest_Params_Data();
  ~NetworkServiceClient_OnCorsPreflightRequest_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnCorsPreflightRequest_Params_Data) == 40,
              "Bad sizeof(NetworkServiceClient_OnCorsPreflightRequest_Params_Data)");
class  NetworkServiceClient_OnCorsPreflightResponse_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnCorsPreflightResponse_Params_Data));
      new (data()) NetworkServiceClient_OnCorsPreflightResponse_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnCorsPreflightResponse_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnCorsPreflightResponse_Params_Data>(index_);
    }
    NetworkServiceClient_OnCorsPreflightResponse_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t render_frame_id;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::URLResponseHead_Data> head;

 private:
  NetworkServiceClient_OnCorsPreflightResponse_Params_Data();
  ~NetworkServiceClient_OnCorsPreflightResponse_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnCorsPreflightResponse_Params_Data) == 40,
              "Bad sizeof(NetworkServiceClient_OnCorsPreflightResponse_Params_Data)");
class  NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data));
      new (data()) NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data>(index_);
    }
    NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t render_frame_id;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
  mojo::internal::Pointer<::network::mojom::internal::URLLoaderCompletionStatus_Data> status;

 private:
  NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data();
  ~NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data) == 32,
              "Bad sizeof(NetworkServiceClient_OnCorsPreflightRequestCompleted_Params_Data)");
class  NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data));
      new (data()) NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data>(index_);
    }
    NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> isolated_world_hostname;

 private:
  NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data();
  ~NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data) == 16,
              "Bad sizeof(NetworkServiceClient_LogCrossOriginFetchFromContentScript3_Params_Data)");
class  NetworkService_SetClient_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetClient_Params_Data));
      new (data()) NetworkService_SetClient_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetClient_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetClient_Params_Data>(index_);
    }
    NetworkService_SetClient_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data client;
  mojo::internal::Pointer<internal::NetworkServiceParams_Data> params;

 private:
  NetworkService_SetClient_Params_Data();
  ~NetworkService_SetClient_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetClient_Params_Data) == 24,
              "Bad sizeof(NetworkService_SetClient_Params_Data)");
class  NetworkService_StartNetLog_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_StartNetLog_Params_Data));
      new (data()) NetworkService_StartNetLog_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_StartNetLog_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_StartNetLog_Params_Data>(index_);
    }
    NetworkService_StartNetLog_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;
  int32_t capture_mode;
  uint8_t pad1_[4];
  mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> constants;

 private:
  NetworkService_StartNetLog_Params_Data();
  ~NetworkService_StartNetLog_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_StartNetLog_Params_Data) == 32,
              "Bad sizeof(NetworkService_StartNetLog_Params_Data)");
class  NetworkService_AttachNetLogProxy_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_AttachNetLogProxy_Params_Data));
      new (data()) NetworkService_AttachNetLogProxy_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_AttachNetLogProxy_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_AttachNetLogProxy_Params_Data>(index_);
    }
    NetworkService_AttachNetLogProxy_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data proxy_source;
  mojo::internal::Handle_Data proxy_sink;
  uint8_t padfinal_[4];

 private:
  NetworkService_AttachNetLogProxy_Params_Data();
  ~NetworkService_AttachNetLogProxy_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_AttachNetLogProxy_Params_Data) == 24,
              "Bad sizeof(NetworkService_AttachNetLogProxy_Params_Data)");
class  NetworkService_SetSSLKeyLogFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetSSLKeyLogFile_Params_Data));
      new (data()) NetworkService_SetSSLKeyLogFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetSSLKeyLogFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetSSLKeyLogFile_Params_Data>(index_);
    }
    NetworkService_SetSSLKeyLogFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;

 private:
  NetworkService_SetSSLKeyLogFile_Params_Data();
  ~NetworkService_SetSSLKeyLogFile_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetSSLKeyLogFile_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetSSLKeyLogFile_Params_Data)");
class  NetworkService_CreateNetworkContext_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_CreateNetworkContext_Params_Data));
      new (data()) NetworkService_CreateNetworkContext_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_CreateNetworkContext_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_CreateNetworkContext_Params_Data>(index_);
    }
    NetworkService_CreateNetworkContext_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data context;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::network::mojom::internal::NetworkContextParams_Data> params;

 private:
  NetworkService_CreateNetworkContext_Params_Data();
  ~NetworkService_CreateNetworkContext_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_CreateNetworkContext_Params_Data) == 24,
              "Bad sizeof(NetworkService_CreateNetworkContext_Params_Data)");
class  NetworkService_ConfigureStubHostResolver_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_ConfigureStubHostResolver_Params_Data));
      new (data()) NetworkService_ConfigureStubHostResolver_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_ConfigureStubHostResolver_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_ConfigureStubHostResolver_Params_Data>(index_);
    }
    NetworkService_ConfigureStubHostResolver_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t insecure_dns_client_enabled : 1;
  uint8_t pad0_[3];
  int32_t secure_dns_mode;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::DnsOverHttpsServer_Data>>> dns_over_https_servers;

 private:
  NetworkService_ConfigureStubHostResolver_Params_Data();
  ~NetworkService_ConfigureStubHostResolver_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ConfigureStubHostResolver_Params_Data) == 24,
              "Bad sizeof(NetworkService_ConfigureStubHostResolver_Params_Data)");
class  NetworkService_DisableQuic_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_DisableQuic_Params_Data));
      new (data()) NetworkService_DisableQuic_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_DisableQuic_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_DisableQuic_Params_Data>(index_);
    }
    NetworkService_DisableQuic_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_DisableQuic_Params_Data();
  ~NetworkService_DisableQuic_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_DisableQuic_Params_Data) == 8,
              "Bad sizeof(NetworkService_DisableQuic_Params_Data)");
class  NetworkService_SetUpHttpAuth_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetUpHttpAuth_Params_Data));
      new (data()) NetworkService_SetUpHttpAuth_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetUpHttpAuth_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetUpHttpAuth_Params_Data>(index_);
    }
    NetworkService_SetUpHttpAuth_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::HttpAuthStaticParams_Data> http_auth_static_params;

 private:
  NetworkService_SetUpHttpAuth_Params_Data();
  ~NetworkService_SetUpHttpAuth_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetUpHttpAuth_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetUpHttpAuth_Params_Data)");
class  NetworkService_ConfigureHttpAuthPrefs_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_ConfigureHttpAuthPrefs_Params_Data));
      new (data()) NetworkService_ConfigureHttpAuthPrefs_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_ConfigureHttpAuthPrefs_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_ConfigureHttpAuthPrefs_Params_Data>(index_);
    }
    NetworkService_ConfigureHttpAuthPrefs_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::HttpAuthDynamicParams_Data> http_auth_dynamic_params;

 private:
  NetworkService_ConfigureHttpAuthPrefs_Params_Data();
  ~NetworkService_ConfigureHttpAuthPrefs_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ConfigureHttpAuthPrefs_Params_Data) == 16,
              "Bad sizeof(NetworkService_ConfigureHttpAuthPrefs_Params_Data)");
class  NetworkService_SetRawHeadersAccess_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetRawHeadersAccess_Params_Data));
      new (data()) NetworkService_SetRawHeadersAccess_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetRawHeadersAccess_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetRawHeadersAccess_Params_Data>(index_);
    }
    NetworkService_SetRawHeadersAccess_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

 private:
  NetworkService_SetRawHeadersAccess_Params_Data();
  ~NetworkService_SetRawHeadersAccess_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetRawHeadersAccess_Params_Data) == 24,
              "Bad sizeof(NetworkService_SetRawHeadersAccess_Params_Data)");
class  NetworkService_SetMaxConnectionsPerProxy_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetMaxConnectionsPerProxy_Params_Data));
      new (data()) NetworkService_SetMaxConnectionsPerProxy_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetMaxConnectionsPerProxy_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetMaxConnectionsPerProxy_Params_Data>(index_);
    }
    NetworkService_SetMaxConnectionsPerProxy_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t max_connections;
  uint8_t padfinal_[4];

 private:
  NetworkService_SetMaxConnectionsPerProxy_Params_Data();
  ~NetworkService_SetMaxConnectionsPerProxy_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetMaxConnectionsPerProxy_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetMaxConnectionsPerProxy_Params_Data)");
class  NetworkService_GetNetworkChangeManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetNetworkChangeManager_Params_Data));
      new (data()) NetworkService_GetNetworkChangeManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetNetworkChangeManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetNetworkChangeManager_Params_Data>(index_);
    }
    NetworkService_GetNetworkChangeManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data network_change_manager;
  uint8_t padfinal_[4];

 private:
  NetworkService_GetNetworkChangeManager_Params_Data();
  ~NetworkService_GetNetworkChangeManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkChangeManager_Params_Data) == 16,
              "Bad sizeof(NetworkService_GetNetworkChangeManager_Params_Data)");
class  NetworkService_GetNetworkQualityEstimatorManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetNetworkQualityEstimatorManager_Params_Data));
      new (data()) NetworkService_GetNetworkQualityEstimatorManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetNetworkQualityEstimatorManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetNetworkQualityEstimatorManager_Params_Data>(index_);
    }
    NetworkService_GetNetworkQualityEstimatorManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  NetworkService_GetNetworkQualityEstimatorManager_Params_Data();
  ~NetworkService_GetNetworkQualityEstimatorManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkQualityEstimatorManager_Params_Data) == 16,
              "Bad sizeof(NetworkService_GetNetworkQualityEstimatorManager_Params_Data)");
class  NetworkService_GetDnsConfigChangeManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetDnsConfigChangeManager_Params_Data));
      new (data()) NetworkService_GetDnsConfigChangeManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetDnsConfigChangeManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetDnsConfigChangeManager_Params_Data>(index_);
    }
    NetworkService_GetDnsConfigChangeManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  NetworkService_GetDnsConfigChangeManager_Params_Data();
  ~NetworkService_GetDnsConfigChangeManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetDnsConfigChangeManager_Params_Data) == 16,
              "Bad sizeof(NetworkService_GetDnsConfigChangeManager_Params_Data)");
class  NetworkService_GetTotalNetworkUsages_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetTotalNetworkUsages_Params_Data));
      new (data()) NetworkService_GetTotalNetworkUsages_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetTotalNetworkUsages_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetTotalNetworkUsages_Params_Data>(index_);
    }
    NetworkService_GetTotalNetworkUsages_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_GetTotalNetworkUsages_Params_Data();
  ~NetworkService_GetTotalNetworkUsages_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetTotalNetworkUsages_Params_Data) == 8,
              "Bad sizeof(NetworkService_GetTotalNetworkUsages_Params_Data)");
class  NetworkService_GetTotalNetworkUsages_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetTotalNetworkUsages_ResponseParams_Data));
      new (data()) NetworkService_GetTotalNetworkUsages_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetTotalNetworkUsages_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetTotalNetworkUsages_ResponseParams_Data>(index_);
    }
    NetworkService_GetTotalNetworkUsages_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::NetworkUsage_Data>>> total_network_usages;

 private:
  NetworkService_GetTotalNetworkUsages_ResponseParams_Data();
  ~NetworkService_GetTotalNetworkUsages_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_GetTotalNetworkUsages_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkService_GetTotalNetworkUsages_ResponseParams_Data)");
class  NetworkService_GetNetworkList_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetNetworkList_Params_Data));
      new (data()) NetworkService_GetNetworkList_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetNetworkList_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetNetworkList_Params_Data>(index_);
    }
    NetworkService_GetNetworkList_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t policy;
  uint8_t padfinal_[4];

 private:
  NetworkService_GetNetworkList_Params_Data();
  ~NetworkService_GetNetworkList_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkList_Params_Data) == 16,
              "Bad sizeof(NetworkService_GetNetworkList_Params_Data)");
class  NetworkService_GetNetworkList_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_GetNetworkList_ResponseParams_Data));
      new (data()) NetworkService_GetNetworkList_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_GetNetworkList_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_GetNetworkList_ResponseParams_Data>(index_);
    }
    NetworkService_GetNetworkList_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::NetworkInterface_Data>>> networks;

 private:
  NetworkService_GetNetworkList_ResponseParams_Data();
  ~NetworkService_GetNetworkList_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkList_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkService_GetNetworkList_ResponseParams_Data)");
class  NetworkService_UpdateCRLSet_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_UpdateCRLSet_Params_Data));
      new (data()) NetworkService_UpdateCRLSet_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_UpdateCRLSet_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_UpdateCRLSet_Params_Data>(index_);
    }
    NetworkService_UpdateCRLSet_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> crl_set;

 private:
  NetworkService_UpdateCRLSet_Params_Data();
  ~NetworkService_UpdateCRLSet_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateCRLSet_Params_Data) == 16,
              "Bad sizeof(NetworkService_UpdateCRLSet_Params_Data)");
class  NetworkService_UpdateCRLSet_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_UpdateCRLSet_ResponseParams_Data));
      new (data()) NetworkService_UpdateCRLSet_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_UpdateCRLSet_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_UpdateCRLSet_ResponseParams_Data>(index_);
    }
    NetworkService_UpdateCRLSet_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_UpdateCRLSet_ResponseParams_Data();
  ~NetworkService_UpdateCRLSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateCRLSet_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkService_UpdateCRLSet_ResponseParams_Data)");
class  NetworkService_UpdateLegacyTLSConfig_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_UpdateLegacyTLSConfig_Params_Data));
      new (data()) NetworkService_UpdateLegacyTLSConfig_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_UpdateLegacyTLSConfig_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_UpdateLegacyTLSConfig_Params_Data>(index_);
    }
    NetworkService_UpdateLegacyTLSConfig_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> config;

 private:
  NetworkService_UpdateLegacyTLSConfig_Params_Data();
  ~NetworkService_UpdateLegacyTLSConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateLegacyTLSConfig_Params_Data) == 16,
              "Bad sizeof(NetworkService_UpdateLegacyTLSConfig_Params_Data)");
class  NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data));
      new (data()) NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data>(index_);
    }
    NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data();
  ~NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkService_UpdateLegacyTLSConfig_ResponseParams_Data)");
class  NetworkService_OnCertDBChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_OnCertDBChanged_Params_Data));
      new (data()) NetworkService_OnCertDBChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_OnCertDBChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_OnCertDBChanged_Params_Data>(index_);
    }
    NetworkService_OnCertDBChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_OnCertDBChanged_Params_Data();
  ~NetworkService_OnCertDBChanged_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnCertDBChanged_Params_Data) == 8,
              "Bad sizeof(NetworkService_OnCertDBChanged_Params_Data)");
class  NetworkService_SetCryptConfig_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetCryptConfig_Params_Data));
      new (data()) NetworkService_SetCryptConfig_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetCryptConfig_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetCryptConfig_Params_Data>(index_);
    }
    NetworkService_SetCryptConfig_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CryptConfig_Data> crypt_config;

 private:
  NetworkService_SetCryptConfig_Params_Data();
  ~NetworkService_SetCryptConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetCryptConfig_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetCryptConfig_Params_Data)");
class  NetworkService_AddCorbExceptionForPlugin_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_AddCorbExceptionForPlugin_Params_Data));
      new (data()) NetworkService_AddCorbExceptionForPlugin_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_AddCorbExceptionForPlugin_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_AddCorbExceptionForPlugin_Params_Data>(index_);
    }
    NetworkService_AddCorbExceptionForPlugin_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  uint8_t padfinal_[4];

 private:
  NetworkService_AddCorbExceptionForPlugin_Params_Data();
  ~NetworkService_AddCorbExceptionForPlugin_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_AddCorbExceptionForPlugin_Params_Data) == 16,
              "Bad sizeof(NetworkService_AddCorbExceptionForPlugin_Params_Data)");
class  NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data));
      new (data()) NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data>(index_);
    }
    NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> allowed_request_initiator;

 private:
  NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data();
  ~NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data) == 24,
              "Bad sizeof(NetworkService_AddAllowedRequestInitiatorForPlugin_Params_Data)");
class  NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data));
      new (data()) NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data>(index_);
    }
    NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  uint8_t padfinal_[4];

 private:
  NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data();
  ~NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data) == 16,
              "Bad sizeof(NetworkService_RemoveSecurityExceptionsForPlugin_Params_Data)");
class  NetworkService_OnMemoryPressure_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_OnMemoryPressure_Params_Data));
      new (data()) NetworkService_OnMemoryPressure_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_OnMemoryPressure_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_OnMemoryPressure_Params_Data>(index_);
    }
    NetworkService_OnMemoryPressure_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t memory_pressure_level;
  uint8_t padfinal_[4];

 private:
  NetworkService_OnMemoryPressure_Params_Data();
  ~NetworkService_OnMemoryPressure_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnMemoryPressure_Params_Data) == 16,
              "Bad sizeof(NetworkService_OnMemoryPressure_Params_Data)");
class  NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data));
      new (data()) NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data>(index_);
    }
    NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t count;
  uint8_t padfinal_[4];

 private:
  NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data();
  ~NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data) == 16,
              "Bad sizeof(NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data)");
class  NetworkService_SetEnvironment_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetEnvironment_Params_Data));
      new (data()) NetworkService_SetEnvironment_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetEnvironment_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetEnvironment_Params_Data>(index_);
    }
    NetworkService_SetEnvironment_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::EnvironmentVariable_Data>>> environment;

 private:
  NetworkService_SetEnvironment_Params_Data();
  ~NetworkService_SetEnvironment_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetEnvironment_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetEnvironment_Params_Data)");
class  NetworkService_SetTrustTokenKeyCommitments_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetTrustTokenKeyCommitments_Params_Data));
      new (data()) NetworkService_SetTrustTokenKeyCommitments_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetTrustTokenKeyCommitments_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetTrustTokenKeyCommitments_Params_Data>(index_);
    }
    NetworkService_SetTrustTokenKeyCommitments_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> raw_commitments;

 private:
  NetworkService_SetTrustTokenKeyCommitments_Params_Data();
  ~NetworkService_SetTrustTokenKeyCommitments_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetTrustTokenKeyCommitments_Params_Data) == 16,
              "Bad sizeof(NetworkService_SetTrustTokenKeyCommitments_Params_Data)");
class  NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data));
      new (data()) NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data>(index_);
    }
    NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data();
  ~NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data)");
class  NetworkService_BindTestInterface_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkService_BindTestInterface_Params_Data));
      new (data()) NetworkService_BindTestInterface_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkService_BindTestInterface_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkService_BindTestInterface_Params_Data>(index_);
    }
    NetworkService_BindTestInterface_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  NetworkService_BindTestInterface_Params_Data();
  ~NetworkService_BindTestInterface_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_BindTestInterface_Params_Data) == 16,
              "Bad sizeof(NetworkService_BindTestInterface_Params_Data)");

}  // namespace internal
class NetworkServiceClient_OnLoadingStateUpdate_ParamsDataView {
 public:
  NetworkServiceClient_OnLoadingStateUpdate_ParamsDataView() {}

  NetworkServiceClient_OnLoadingStateUpdate_ParamsDataView(
      internal::NetworkServiceClient_OnLoadingStateUpdate_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetInfosDataView(
      mojo::ArrayDataView<LoadInfoDataView>* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadInfos(UserType* output) {
    auto* pointer = data_->infos.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::network::mojom::LoadInfoDataView>>(
        pointer, output, context_);
  }
 private:
