// services/network/public/mojom/network_context.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_CONTEXT_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_CONTEXT_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace network {
namespace mojom {
namespace internal {
class  CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data));
      new (data()) CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data>(index_);
    }
    CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CustomProxyConfig_Data> proxy_config;

 private:
  CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data();
  ~CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data() = delete;
};
static_assert(sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data) == 16,
              "Bad sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data)");
class  CustomProxyConfigClient_MarkProxiesAsBad_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(CustomProxyConfigClient_MarkProxiesAsBad_Params_Data));
      new (data()) CustomProxyConfigClient_MarkProxiesAsBad_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    CustomProxyConfigClient_MarkProxiesAsBad_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<CustomProxyConfigClient_MarkProxiesAsBad_Params_Data>(index_);
    }
    CustomProxyConfigClient_MarkProxiesAsBad_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> bypass_duration;
  mojo::internal::Pointer<::network::mojom::internal::ProxyList_Data> bad_proxies;

 private:
  CustomProxyConfigClient_MarkProxiesAsBad_Params_Data();
  ~CustomProxyConfigClient_MarkProxiesAsBad_Params_Data() = delete;
};
static_assert(sizeof(CustomProxyConfigClient_MarkProxiesAsBad_Params_Data) == 24,
              "Bad sizeof(CustomProxyConfigClient_MarkProxiesAsBad_Params_Data)");
class  CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data));
      new (data()) CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data>(index_);
    }
    CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data();
  ~CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data() = delete;
};
static_assert(sizeof(CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data) == 8,
              "Bad sizeof(CustomProxyConfigClient_MarkProxiesAsBad_ResponseParams_Data)");
class  CustomProxyConfigClient_ClearBadProxiesCache_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(CustomProxyConfigClient_ClearBadProxiesCache_Params_Data));
      new (data()) CustomProxyConfigClient_ClearBadProxiesCache_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    CustomProxyConfigClient_ClearBadProxiesCache_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<CustomProxyConfigClient_ClearBadProxiesCache_Params_Data>(index_);
    }
    CustomProxyConfigClient_ClearBadProxiesCache_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  CustomProxyConfigClient_ClearBadProxiesCache_Params_Data();
  ~CustomProxyConfigClient_ClearBadProxiesCache_Params_Data() = delete;
};
static_assert(sizeof(CustomProxyConfigClient_ClearBadProxiesCache_Params_Data) == 8,
              "Bad sizeof(CustomProxyConfigClient_ClearBadProxiesCache_Params_Data)");
class  TrustedHeaderClient_OnBeforeSendHeaders_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedHeaderClient_OnBeforeSendHeaders_Params_Data));
      new (data()) TrustedHeaderClient_OnBeforeSendHeaders_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedHeaderClient_OnBeforeSendHeaders_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedHeaderClient_OnBeforeSendHeaders_Params_Data>(index_);
    }
    TrustedHeaderClient_OnBeforeSendHeaders_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> headers;

 private:
  TrustedHeaderClient_OnBeforeSendHeaders_Params_Data();
  ~TrustedHeaderClient_OnBeforeSendHeaders_Params_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnBeforeSendHeaders_Params_Data) == 16,
              "Bad sizeof(TrustedHeaderClient_OnBeforeSendHeaders_Params_Data)");
class  TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data));
      new (data()) TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data>(index_);
    }
    TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> headers;

 private:
  TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data();
  ~TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data) == 24,
              "Bad sizeof(TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data)");
class  TrustedHeaderClient_OnHeadersReceived_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedHeaderClient_OnHeadersReceived_Params_Data));
      new (data()) TrustedHeaderClient_OnHeadersReceived_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedHeaderClient_OnHeadersReceived_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedHeaderClient_OnHeadersReceived_Params_Data>(index_);
    }
    TrustedHeaderClient_OnHeadersReceived_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> headers;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> remote_endpoint;

 private:
  TrustedHeaderClient_OnHeadersReceived_Params_Data();
  ~TrustedHeaderClient_OnHeadersReceived_Params_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnHeadersReceived_Params_Data) == 24,
              "Bad sizeof(TrustedHeaderClient_OnHeadersReceived_Params_Data)");
class  TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data));
      new (data()) TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data>(index_);
    }
    TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::String_Data> headers;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> preserve_fragment_on_redirect_url;

 private:
  TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data();
  ~TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data) == 32,
              "Bad sizeof(TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data)");
class  TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data));
      new (data()) TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data>(index_);
    }
    TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t request_id;
  mojo::internal::Handle_Data header_client;

 private:
  TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data();
  ~TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data() = delete;
};
static_assert(sizeof(TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data) == 16,
              "Bad sizeof(TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data)");
class  TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data));
      new (data()) TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data>(index_);
    }
    TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::URLRequest_Data> request;
  mojo::internal::Handle_Data header_client;
  uint8_t padfinal_[4];

 private:
  TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data();
  ~TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data() = delete;
};
static_assert(sizeof(TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data) == 24,
              "Bad sizeof(TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data)");
class  AuthChallengeResponder_OnAuthCredentials_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AuthChallengeResponder_OnAuthCredentials_Params_Data));
      new (data()) AuthChallengeResponder_OnAuthCredentials_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AuthChallengeResponder_OnAuthCredentials_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AuthChallengeResponder_OnAuthCredentials_Params_Data>(index_);
    }
    AuthChallengeResponder_OnAuthCredentials_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

 private:
  AuthChallengeResponder_OnAuthCredentials_Params_Data();
  ~AuthChallengeResponder_OnAuthCredentials_Params_Data() = delete;
};
static_assert(sizeof(AuthChallengeResponder_OnAuthCredentials_Params_Data) == 16,
              "Bad sizeof(AuthChallengeResponder_OnAuthCredentials_Params_Data)");
class  ClientCertificateResponder_ContinueWithCertificate_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(ClientCertificateResponder_ContinueWithCertificate_Params_Data));
      new (data()) ClientCertificateResponder_ContinueWithCertificate_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    ClientCertificateResponder_ContinueWithCertificate_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<ClientCertificateResponder_ContinueWithCertificate_Params_Data>(index_);
    }
    ClientCertificateResponder_ContinueWithCertificate_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> x509_certificate;
  mojo::internal::Pointer<mojo::internal::String_Data> provider_name;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint16_t>> algorithm_preferences;
  mojo::internal::Interface_Data ssl_private_key;

 private:
  ClientCertificateResponder_ContinueWithCertificate_Params_Data();
  ~ClientCertificateResponder_ContinueWithCertificate_Params_Data() = delete;
};
static_assert(sizeof(ClientCertificateResponder_ContinueWithCertificate_Params_Data) == 40,
              "Bad sizeof(ClientCertificateResponder_ContinueWithCertificate_Params_Data)");
class  ClientCertificateResponder_ContinueWithoutCertificate_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(ClientCertificateResponder_ContinueWithoutCertificate_Params_Data));
      new (data()) ClientCertificateResponder_ContinueWithoutCertificate_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    ClientCertificateResponder_ContinueWithoutCertificate_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<ClientCertificateResponder_ContinueWithoutCertificate_Params_Data>(index_);
    }
    ClientCertificateResponder_ContinueWithoutCertificate_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  ClientCertificateResponder_ContinueWithoutCertificate_Params_Data();
  ~ClientCertificateResponder_ContinueWithoutCertificate_Params_Data() = delete;
};
static_assert(sizeof(ClientCertificateResponder_ContinueWithoutCertificate_Params_Data) == 8,
              "Bad sizeof(ClientCertificateResponder_ContinueWithoutCertificate_Params_Data)");
class  ClientCertificateResponder_CancelRequest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(ClientCertificateResponder_CancelRequest_Params_Data));
      new (data()) ClientCertificateResponder_CancelRequest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    ClientCertificateResponder_CancelRequest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<ClientCertificateResponder_CancelRequest_Params_Data>(index_);
    }
    ClientCertificateResponder_CancelRequest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  ClientCertificateResponder_CancelRequest_Params_Data();
  ~ClientCertificateResponder_CancelRequest_Params_Data() = delete;
};
static_assert(sizeof(ClientCertificateResponder_CancelRequest_Params_Data) == 8,
              "Bad sizeof(ClientCertificateResponder_CancelRequest_Params_Data)");
class  SSLPrivateKey_Sign_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(SSLPrivateKey_Sign_Params_Data));
      new (data()) SSLPrivateKey_Sign_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    SSLPrivateKey_Sign_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<SSLPrivateKey_Sign_Params_Data>(index_);
    }
    SSLPrivateKey_Sign_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint16_t algorithm;
  uint8_t pad0_[6];
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> input;

 private:
  SSLPrivateKey_Sign_Params_Data();
  ~SSLPrivateKey_Sign_Params_Data() = delete;
};
static_assert(sizeof(SSLPrivateKey_Sign_Params_Data) == 24,
              "Bad sizeof(SSLPrivateKey_Sign_Params_Data)");
class  SSLPrivateKey_Sign_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(SSLPrivateKey_Sign_ResponseParams_Data));
      new (data()) SSLPrivateKey_Sign_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    SSLPrivateKey_Sign_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<SSLPrivateKey_Sign_ResponseParams_Data>(index_);
    }
    SSLPrivateKey_Sign_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t net_error;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> signature;

 private:
  SSLPrivateKey_Sign_ResponseParams_Data();
  ~SSLPrivateKey_Sign_ResponseParams_Data() = delete;
};
static_assert(sizeof(SSLPrivateKey_Sign_ResponseParams_Data) == 24,
              "Bad sizeof(SSLPrivateKey_Sign_ResponseParams_Data)");
class  NetworkContextClient_OnAuthRequired_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnAuthRequired_Params_Data));
      new (data()) NetworkContextClient_OnAuthRequired_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnAuthRequired_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnAuthRequired_Params_Data>(index_);
    }
    NetworkContextClient_OnAuthRequired_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> window_id;
  int32_t process_id;
  int32_t routing_id;
  uint32_t request_id;
  uint8_t first_auth_attempt : 1;
  uint8_t pad4_[3];
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::AuthChallengeInfo_Data> auth_info;
  mojo::internal::Pointer<::network::mojom::internal::URLResponseHead_Data> head;
  mojo::internal::Interface_Data auth_challenge_responder;

 private:
  NetworkContextClient_OnAuthRequired_Params_Data();
  ~NetworkContextClient_OnAuthRequired_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnAuthRequired_Params_Data) == 64,
              "Bad sizeof(NetworkContextClient_OnAuthRequired_Params_Data)");
class  NetworkContextClient_OnCertificateRequested_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnCertificateRequested_Params_Data));
      new (data()) NetworkContextClient_OnCertificateRequested_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnCertificateRequested_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnCertificateRequested_Params_Data>(index_);
    }
    NetworkContextClient_OnCertificateRequested_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> window_id;
  int32_t process_id;
  int32_t routing_id;
  uint32_t request_id;
  uint8_t pad3_[4];
  mojo::internal::Pointer<::network::mojom::internal::SSLCertRequestInfo_Data> cert_info;
  mojo::internal::Interface_Data cert_responder;

 private:
  NetworkContextClient_OnCertificateRequested_Params_Data();
  ~NetworkContextClient_OnCertificateRequested_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnCertificateRequested_Params_Data) == 48,
              "Bad sizeof(NetworkContextClient_OnCertificateRequested_Params_Data)");
class  NetworkContextClient_OnSSLCertificateError_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnSSLCertificateError_Params_Data));
      new (data()) NetworkContextClient_OnSSLCertificateError_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnSSLCertificateError_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnSSLCertificateError_Params_Data>(index_);
    }
    NetworkContextClient_OnSSLCertificateError_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t routing_id;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  int32_t net_error;
  uint8_t fatal : 1;
  uint8_t pad4_[3];
  mojo::internal::Pointer<::network::mojom::internal::SSLInfo_Data> ssl_info;

 private:
  NetworkContextClient_OnSSLCertificateError_Params_Data();
  ~NetworkContextClient_OnSSLCertificateError_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnSSLCertificateError_Params_Data) == 40,
              "Bad sizeof(NetworkContextClient_OnSSLCertificateError_Params_Data)");
class  NetworkContextClient_OnSSLCertificateError_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnSSLCertificateError_ResponseParams_Data));
      new (data()) NetworkContextClient_OnSSLCertificateError_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnSSLCertificateError_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnSSLCertificateError_ResponseParams_Data>(index_);
    }
    NetworkContextClient_OnSSLCertificateError_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t net_error;
  uint8_t padfinal_[4];

 private:
  NetworkContextClient_OnSSLCertificateError_ResponseParams_Data();
  ~NetworkContextClient_OnSSLCertificateError_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnSSLCertificateError_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContextClient_OnSSLCertificateError_ResponseParams_Data)");
class  NetworkContextClient_OnFileUploadRequested_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnFileUploadRequested_Params_Data));
      new (data()) NetworkContextClient_OnFileUploadRequested_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnFileUploadRequested_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnFileUploadRequested_Params_Data>(index_);
    }
    NetworkContextClient_OnFileUploadRequested_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  uint8_t async : 1;
  uint8_t pad1_[3];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> file_paths;

 private:
  NetworkContextClient_OnFileUploadRequested_Params_Data();
  ~NetworkContextClient_OnFileUploadRequested_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnFileUploadRequested_Params_Data) == 24,
              "Bad sizeof(NetworkContextClient_OnFileUploadRequested_Params_Data)");
class  NetworkContextClient_OnFileUploadRequested_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnFileUploadRequested_ResponseParams_Data));
      new (data()) NetworkContextClient_OnFileUploadRequested_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnFileUploadRequested_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnFileUploadRequested_ResponseParams_Data>(index_);
    }
    NetworkContextClient_OnFileUploadRequested_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t net_error;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data>>> files;

 private:
  NetworkContextClient_OnFileUploadRequested_ResponseParams_Data();
  ~NetworkContextClient_OnFileUploadRequested_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnFileUploadRequested_ResponseParams_Data) == 24,
              "Bad sizeof(NetworkContextClient_OnFileUploadRequested_ResponseParams_Data)");
class  NetworkContextClient_OnCanSendReportingReports_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnCanSendReportingReports_Params_Data));
      new (data()) NetworkContextClient_OnCanSendReportingReports_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnCanSendReportingReports_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnCanSendReportingReports_Params_Data>(index_);
    }
    NetworkContextClient_OnCanSendReportingReports_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

 private:
  NetworkContextClient_OnCanSendReportingReports_Params_Data();
  ~NetworkContextClient_OnCanSendReportingReports_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnCanSendReportingReports_Params_Data) == 16,
              "Bad sizeof(NetworkContextClient_OnCanSendReportingReports_Params_Data)");
class  NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data));
      new (data()) NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data>(index_);
    }
    NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

 private:
  NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data();
  ~NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContextClient_OnCanSendReportingReports_ResponseParams_Data)");
class  NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data));
      new (data()) NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data>(index_);
    }
    NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> origin;

 private:
  NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data();
  ~NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data) == 16,
              "Bad sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_Params_Data)");
class  NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data));
      new (data()) NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data>(index_);
    }
    NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t allowed : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data();
  ~NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContextClient_OnCanSendDomainReliabilityUpload_ResponseParams_Data)");
class  NetworkContextClient_OnClearSiteData_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnClearSiteData_Params_Data));
      new (data()) NetworkContextClient_OnClearSiteData_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnClearSiteData_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnClearSiteData_Params_Data>(index_);
    }
    NetworkContextClient_OnClearSiteData_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t process_id;
  int32_t routing_id;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::String_Data> header_value;
  int32_t load_flags;
  uint8_t padfinal_[4];

 private:
  NetworkContextClient_OnClearSiteData_Params_Data();
  ~NetworkContextClient_OnClearSiteData_Params_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnClearSiteData_Params_Data) == 40,
              "Bad sizeof(NetworkContextClient_OnClearSiteData_Params_Data)");
class  NetworkContextClient_OnClearSiteData_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContextClient_OnClearSiteData_ResponseParams_Data));
      new (data()) NetworkContextClient_OnClearSiteData_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContextClient_OnClearSiteData_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContextClient_OnClearSiteData_ResponseParams_Data>(index_);
    }
    NetworkContextClient_OnClearSiteData_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContextClient_OnClearSiteData_ResponseParams_Data();
  ~NetworkContextClient_OnClearSiteData_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContextClient_OnClearSiteData_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContextClient_OnClearSiteData_ResponseParams_Data)");
class  NetworkContext_SetClient_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetClient_Params_Data));
      new (data()) NetworkContext_SetClient_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetClient_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetClient_Params_Data>(index_);
    }
    NetworkContext_SetClient_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data client;

 private:
  NetworkContext_SetClient_Params_Data();
  ~NetworkContext_SetClient_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetClient_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetClient_Params_Data)");
class  NetworkContext_CreateURLLoaderFactory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateURLLoaderFactory_Params_Data));
      new (data()) NetworkContext_CreateURLLoaderFactory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateURLLoaderFactory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateURLLoaderFactory_Params_Data>(index_);
    }
    NetworkContext_CreateURLLoaderFactory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data url_loader_factory;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::URLLoaderFactoryParams_Data> params;

 private:
  NetworkContext_CreateURLLoaderFactory_Params_Data();
  ~NetworkContext_CreateURLLoaderFactory_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateURLLoaderFactory_Params_Data) == 24,
              "Bad sizeof(NetworkContext_CreateURLLoaderFactory_Params_Data)");
class  NetworkContext_ResetURLLoaderFactories_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ResetURLLoaderFactories_Params_Data));
      new (data()) NetworkContext_ResetURLLoaderFactories_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ResetURLLoaderFactories_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ResetURLLoaderFactories_Params_Data>(index_);
    }
    NetworkContext_ResetURLLoaderFactories_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ResetURLLoaderFactories_Params_Data();
  ~NetworkContext_ResetURLLoaderFactories_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ResetURLLoaderFactories_Params_Data) == 8,
              "Bad sizeof(NetworkContext_ResetURLLoaderFactories_Params_Data)");
class  NetworkContext_GetCookieManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetCookieManager_Params_Data));
      new (data()) NetworkContext_GetCookieManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetCookieManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetCookieManager_Params_Data>(index_);
    }
    NetworkContext_GetCookieManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data cookie_manager;
  uint8_t padfinal_[4];

 private:
  NetworkContext_GetCookieManager_Params_Data();
  ~NetworkContext_GetCookieManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetCookieManager_Params_Data) == 16,
              "Bad sizeof(NetworkContext_GetCookieManager_Params_Data)");
class  NetworkContext_GetRestrictedCookieManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetRestrictedCookieManager_Params_Data));
      new (data()) NetworkContext_GetRestrictedCookieManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetRestrictedCookieManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetRestrictedCookieManager_Params_Data>(index_);
    }
    NetworkContext_GetRestrictedCookieManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data restricted_cookie_manager;
  int32_t role;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
  mojo::internal::Interface_Data cookie_observer;

 private:
  NetworkContext_GetRestrictedCookieManager_Params_Data();
  ~NetworkContext_GetRestrictedCookieManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetRestrictedCookieManager_Params_Data) == 48,
              "Bad sizeof(NetworkContext_GetRestrictedCookieManager_Params_Data)");
class  NetworkContext_GetHasTrustTokensAnswerer_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetHasTrustTokensAnswerer_Params_Data));
      new (data()) NetworkContext_GetHasTrustTokensAnswerer_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetHasTrustTokensAnswerer_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetHasTrustTokensAnswerer_Params_Data>(index_);
    }
    NetworkContext_GetHasTrustTokensAnswerer_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data has_trust_tokens_answerer;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;

 private:
  NetworkContext_GetHasTrustTokensAnswerer_Params_Data();
  ~NetworkContext_GetHasTrustTokensAnswerer_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetHasTrustTokensAnswerer_Params_Data) == 24,
              "Bad sizeof(NetworkContext_GetHasTrustTokensAnswerer_Params_Data)");
class  NetworkContext_ClearTrustTokenData_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearTrustTokenData_Params_Data));
      new (data()) NetworkContext_ClearTrustTokenData_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearTrustTokenData_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearTrustTokenData_Params_Data>(index_);
    }
    NetworkContext_ClearTrustTokenData_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearTrustTokenData_Params_Data();
  ~NetworkContext_ClearTrustTokenData_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenData_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearTrustTokenData_Params_Data)");
class  NetworkContext_ClearTrustTokenData_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearTrustTokenData_ResponseParams_Data));
      new (data()) NetworkContext_ClearTrustTokenData_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearTrustTokenData_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearTrustTokenData_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearTrustTokenData_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearTrustTokenData_ResponseParams_Data();
  ~NetworkContext_ClearTrustTokenData_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenData_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearTrustTokenData_ResponseParams_Data)");
class  NetworkContext_ClearNetworkingHistorySince_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearNetworkingHistorySince_Params_Data));
      new (data()) NetworkContext_ClearNetworkingHistorySince_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearNetworkingHistorySince_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearNetworkingHistorySince_Params_Data>(index_);
    }
    NetworkContext_ClearNetworkingHistorySince_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;

 private:
  NetworkContext_ClearNetworkingHistorySince_Params_Data();
  ~NetworkContext_ClearNetworkingHistorySince_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkingHistorySince_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearNetworkingHistorySince_Params_Data)");
class  NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data));
      new (data()) NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data();
  ~NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearNetworkingHistorySince_ResponseParams_Data)");
class  NetworkContext_ClearHttpCache_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHttpCache_Params_Data));
      new (data()) NetworkContext_ClearHttpCache_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHttpCache_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHttpCache_Params_Data>(index_);
    }
    NetworkContext_ClearHttpCache_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearHttpCache_Params_Data();
  ~NetworkContext_ClearHttpCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpCache_Params_Data) == 32,
              "Bad sizeof(NetworkContext_ClearHttpCache_Params_Data)");
class  NetworkContext_ClearHttpCache_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHttpCache_ResponseParams_Data));
      new (data()) NetworkContext_ClearHttpCache_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHttpCache_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHttpCache_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearHttpCache_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearHttpCache_ResponseParams_Data();
  ~NetworkContext_ClearHttpCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpCache_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearHttpCache_ResponseParams_Data)");
class  NetworkContext_ComputeHttpCacheSize_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ComputeHttpCacheSize_Params_Data));
      new (data()) NetworkContext_ComputeHttpCacheSize_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ComputeHttpCacheSize_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ComputeHttpCacheSize_Params_Data>(index_);
    }
    NetworkContext_ComputeHttpCacheSize_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;

 private:
  NetworkContext_ComputeHttpCacheSize_Params_Data();
  ~NetworkContext_ComputeHttpCacheSize_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ComputeHttpCacheSize_Params_Data) == 24,
              "Bad sizeof(NetworkContext_ComputeHttpCacheSize_Params_Data)");
class  NetworkContext_ComputeHttpCacheSize_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ComputeHttpCacheSize_ResponseParams_Data));
      new (data()) NetworkContext_ComputeHttpCacheSize_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ComputeHttpCacheSize_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ComputeHttpCacheSize_ResponseParams_Data>(index_);
    }
    NetworkContext_ComputeHttpCacheSize_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_upper_bound : 1;
  uint8_t pad0_[7];
  int64_t size_or_error;

 private:
  NetworkContext_ComputeHttpCacheSize_ResponseParams_Data();
  ~NetworkContext_ComputeHttpCacheSize_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ComputeHttpCacheSize_ResponseParams_Data) == 24,
              "Bad sizeof(NetworkContext_ComputeHttpCacheSize_ResponseParams_Data)");
class  NetworkContext_NotifyExternalCacheHit_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_NotifyExternalCacheHit_Params_Data));
      new (data()) NetworkContext_NotifyExternalCacheHit_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_NotifyExternalCacheHit_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_NotifyExternalCacheHit_Params_Data>(index_);
    }
    NetworkContext_NotifyExternalCacheHit_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::String_Data> http_method;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> key;

 private:
  NetworkContext_NotifyExternalCacheHit_Params_Data();
  ~NetworkContext_NotifyExternalCacheHit_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_NotifyExternalCacheHit_Params_Data) == 32,
              "Bad sizeof(NetworkContext_NotifyExternalCacheHit_Params_Data)");
class  NetworkContext_ClearHostCache_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHostCache_Params_Data));
      new (data()) NetworkContext_ClearHostCache_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHostCache_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHostCache_Params_Data>(index_);
    }
    NetworkContext_ClearHostCache_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearHostCache_Params_Data();
  ~NetworkContext_ClearHostCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHostCache_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearHostCache_Params_Data)");
class  NetworkContext_ClearHostCache_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHostCache_ResponseParams_Data));
      new (data()) NetworkContext_ClearHostCache_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHostCache_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHostCache_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearHostCache_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearHostCache_ResponseParams_Data();
  ~NetworkContext_ClearHostCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHostCache_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearHostCache_ResponseParams_Data)");
class  NetworkContext_ClearHttpAuthCache_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHttpAuthCache_Params_Data));
      new (data()) NetworkContext_ClearHttpAuthCache_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHttpAuthCache_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHttpAuthCache_Params_Data>(index_);
    }
    NetworkContext_ClearHttpAuthCache_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;

 private:
  NetworkContext_ClearHttpAuthCache_Params_Data();
  ~NetworkContext_ClearHttpAuthCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpAuthCache_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearHttpAuthCache_Params_Data)");
class  NetworkContext_ClearHttpAuthCache_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearHttpAuthCache_ResponseParams_Data));
      new (data()) NetworkContext_ClearHttpAuthCache_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearHttpAuthCache_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearHttpAuthCache_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearHttpAuthCache_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearHttpAuthCache_ResponseParams_Data();
  ~NetworkContext_ClearHttpAuthCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpAuthCache_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearHttpAuthCache_ResponseParams_Data)");
class  NetworkContext_ClearReportingCacheReports_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearReportingCacheReports_Params_Data));
      new (data()) NetworkContext_ClearReportingCacheReports_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearReportingCacheReports_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearReportingCacheReports_Params_Data>(index_);
    }
    NetworkContext_ClearReportingCacheReports_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearReportingCacheReports_Params_Data();
  ~NetworkContext_ClearReportingCacheReports_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheReports_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearReportingCacheReports_Params_Data)");
class  NetworkContext_ClearReportingCacheReports_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearReportingCacheReports_ResponseParams_Data));
      new (data()) NetworkContext_ClearReportingCacheReports_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearReportingCacheReports_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearReportingCacheReports_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearReportingCacheReports_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearReportingCacheReports_ResponseParams_Data();
  ~NetworkContext_ClearReportingCacheReports_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheReports_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearReportingCacheReports_ResponseParams_Data)");
class  NetworkContext_ClearReportingCacheClients_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearReportingCacheClients_Params_Data));
      new (data()) NetworkContext_ClearReportingCacheClients_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearReportingCacheClients_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearReportingCacheClients_Params_Data>(index_);
    }
    NetworkContext_ClearReportingCacheClients_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearReportingCacheClients_Params_Data();
  ~NetworkContext_ClearReportingCacheClients_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheClients_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearReportingCacheClients_Params_Data)");
class  NetworkContext_ClearReportingCacheClients_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearReportingCacheClients_ResponseParams_Data));
      new (data()) NetworkContext_ClearReportingCacheClients_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearReportingCacheClients_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearReportingCacheClients_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearReportingCacheClients_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearReportingCacheClients_ResponseParams_Data();
  ~NetworkContext_ClearReportingCacheClients_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheClients_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearReportingCacheClients_ResponseParams_Data)");
class  NetworkContext_ClearNetworkErrorLogging_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearNetworkErrorLogging_Params_Data));
      new (data()) NetworkContext_ClearNetworkErrorLogging_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearNetworkErrorLogging_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearNetworkErrorLogging_Params_Data>(index_);
    }
    NetworkContext_ClearNetworkErrorLogging_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;

 private:
  NetworkContext_ClearNetworkErrorLogging_Params_Data();
  ~NetworkContext_ClearNetworkErrorLogging_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkErrorLogging_Params_Data) == 16,
              "Bad sizeof(NetworkContext_ClearNetworkErrorLogging_Params_Data)");
class  NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data));
      new (data()) NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data();
  ~NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data)");
class  NetworkContext_ClearDomainReliability_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearDomainReliability_Params_Data));
      new (data()) NetworkContext_ClearDomainReliability_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearDomainReliability_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearDomainReliability_Params_Data>(index_);
    }
    NetworkContext_ClearDomainReliability_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::ClearDataFilter_Data> filter;
  int32_t mode;
  uint8_t padfinal_[4];

 private:
  NetworkContext_ClearDomainReliability_Params_Data();
  ~NetworkContext_ClearDomainReliability_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearDomainReliability_Params_Data) == 24,
              "Bad sizeof(NetworkContext_ClearDomainReliability_Params_Data)");
class  NetworkContext_ClearDomainReliability_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearDomainReliability_ResponseParams_Data));
      new (data()) NetworkContext_ClearDomainReliability_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearDomainReliability_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearDomainReliability_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearDomainReliability_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearDomainReliability_ResponseParams_Data();
  ~NetworkContext_ClearDomainReliability_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearDomainReliability_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearDomainReliability_ResponseParams_Data)");
class  NetworkContext_GetDomainReliabilityJSON_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetDomainReliabilityJSON_Params_Data));
      new (data()) NetworkContext_GetDomainReliabilityJSON_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetDomainReliabilityJSON_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetDomainReliabilityJSON_Params_Data>(index_);
    }
    NetworkContext_GetDomainReliabilityJSON_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_GetDomainReliabilityJSON_Params_Data();
  ~NetworkContext_GetDomainReliabilityJSON_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetDomainReliabilityJSON_Params_Data) == 8,
              "Bad sizeof(NetworkContext_GetDomainReliabilityJSON_Params_Data)");
class  NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data));
      new (data()) NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data>(index_);
    }
    NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  ::mojo_base::mojom::internal::Value_Data data;

 private:
  NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data();
  ~NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data) == 24,
              "Bad sizeof(NetworkContext_GetDomainReliabilityJSON_ResponseParams_Data)");
class  NetworkContext_QueueReport_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_QueueReport_Params_Data));
      new (data()) NetworkContext_QueueReport_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_QueueReport_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_QueueReport_Params_Data>(index_);
    }
    NetworkContext_QueueReport_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> type;
  mojo::internal::Pointer<mojo::internal::String_Data> group;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::String_Data> user_agent;
  mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> body;

 private:
  NetworkContext_QueueReport_Params_Data();
  ~NetworkContext_QueueReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_QueueReport_Params_Data) == 48,
              "Bad sizeof(NetworkContext_QueueReport_Params_Data)");
class  NetworkContext_QueueSignedExchangeReport_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_QueueSignedExchangeReport_Params_Data));
      new (data()) NetworkContext_QueueSignedExchangeReport_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_QueueSignedExchangeReport_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_QueueSignedExchangeReport_Params_Data>(index_);
    }
    NetworkContext_QueueSignedExchangeReport_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SignedExchangeReport_Data> report;

 private:
  NetworkContext_QueueSignedExchangeReport_Params_Data();
  ~NetworkContext_QueueSignedExchangeReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_QueueSignedExchangeReport_Params_Data) == 16,
              "Bad sizeof(NetworkContext_QueueSignedExchangeReport_Params_Data)");
class  NetworkContext_CloseAllConnections_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CloseAllConnections_Params_Data));
      new (data()) NetworkContext_CloseAllConnections_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CloseAllConnections_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CloseAllConnections_Params_Data>(index_);
    }
    NetworkContext_CloseAllConnections_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_CloseAllConnections_Params_Data();
  ~NetworkContext_CloseAllConnections_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseAllConnections_Params_Data) == 8,
              "Bad sizeof(NetworkContext_CloseAllConnections_Params_Data)");
class  NetworkContext_CloseAllConnections_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CloseAllConnections_ResponseParams_Data));
      new (data()) NetworkContext_CloseAllConnections_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CloseAllConnections_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CloseAllConnections_ResponseParams_Data>(index_);
    }
    NetworkContext_CloseAllConnections_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_CloseAllConnections_ResponseParams_Data();
  ~NetworkContext_CloseAllConnections_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseAllConnections_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_CloseAllConnections_ResponseParams_Data)");
class  NetworkContext_CloseIdleConnections_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CloseIdleConnections_Params_Data));
      new (data()) NetworkContext_CloseIdleConnections_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CloseIdleConnections_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CloseIdleConnections_Params_Data>(index_);
    }
    NetworkContext_CloseIdleConnections_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_CloseIdleConnections_Params_Data();
  ~NetworkContext_CloseIdleConnections_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseIdleConnections_Params_Data) == 8,
              "Bad sizeof(NetworkContext_CloseIdleConnections_Params_Data)");
class  NetworkContext_CloseIdleConnections_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CloseIdleConnections_ResponseParams_Data));
      new (data()) NetworkContext_CloseIdleConnections_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CloseIdleConnections_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CloseIdleConnections_ResponseParams_Data>(index_);
    }
    NetworkContext_CloseIdleConnections_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_CloseIdleConnections_ResponseParams_Data();
  ~NetworkContext_CloseIdleConnections_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseIdleConnections_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_CloseIdleConnections_ResponseParams_Data)");
class  NetworkContext_SetNetworkConditions_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetNetworkConditions_Params_Data));
      new (data()) NetworkContext_SetNetworkConditions_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetNetworkConditions_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetNetworkConditions_Params_Data>(index_);
    }
    NetworkContext_SetNetworkConditions_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> throttling_profile_id;
  mojo::internal::Pointer<internal::NetworkConditions_Data> conditions;

 private:
  NetworkContext_SetNetworkConditions_Params_Data();
  ~NetworkContext_SetNetworkConditions_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetNetworkConditions_Params_Data) == 24,
              "Bad sizeof(NetworkContext_SetNetworkConditions_Params_Data)");
class  NetworkContext_SetAcceptLanguage_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetAcceptLanguage_Params_Data));
      new (data()) NetworkContext_SetAcceptLanguage_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetAcceptLanguage_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetAcceptLanguage_Params_Data>(index_);
    }
    NetworkContext_SetAcceptLanguage_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> new_accept_language;

 private:
  NetworkContext_SetAcceptLanguage_Params_Data();
  ~NetworkContext_SetAcceptLanguage_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetAcceptLanguage_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetAcceptLanguage_Params_Data)");
class  NetworkContext_SetEnableReferrers_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetEnableReferrers_Params_Data));
      new (data()) NetworkContext_SetEnableReferrers_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetEnableReferrers_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetEnableReferrers_Params_Data>(index_);
    }
    NetworkContext_SetEnableReferrers_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t enable_referrers : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_SetEnableReferrers_Params_Data();
  ~NetworkContext_SetEnableReferrers_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetEnableReferrers_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetEnableReferrers_Params_Data)");
class  NetworkContext_SetCTPolicy_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetCTPolicy_Params_Data));
      new (data()) NetworkContext_SetCTPolicy_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetCTPolicy_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetCTPolicy_Params_Data>(index_);
    }
    NetworkContext_SetCTPolicy_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::CTPolicy_Data> ct_policy;

 private:
  NetworkContext_SetCTPolicy_Params_Data();
  ~NetworkContext_SetCTPolicy_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCTPolicy_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetCTPolicy_Params_Data)");
class  NetworkContext_AddExpectCT_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddExpectCT_Params_Data));
      new (data()) NetworkContext_AddExpectCT_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddExpectCT_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddExpectCT_Params_Data>(index_);
    }
    NetworkContext_AddExpectCT_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> host;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expiry;
  uint8_t enforce : 1;
  uint8_t pad2_[7];
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> report_uri;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;

 private:
  NetworkContext_AddExpectCT_Params_Data();
  ~NetworkContext_AddExpectCT_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddExpectCT_Params_Data) == 48,
              "Bad sizeof(NetworkContext_AddExpectCT_Params_Data)");
class  NetworkContext_AddExpectCT_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddExpectCT_ResponseParams_Data));
      new (data()) NetworkContext_AddExpectCT_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddExpectCT_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddExpectCT_ResponseParams_Data>(index_);
    }
    NetworkContext_AddExpectCT_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_AddExpectCT_ResponseParams_Data();
  ~NetworkContext_AddExpectCT_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddExpectCT_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_AddExpectCT_ResponseParams_Data)");
class  NetworkContext_SetExpectCTTestReport_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetExpectCTTestReport_Params_Data));
      new (data()) NetworkContext_SetExpectCTTestReport_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetExpectCTTestReport_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetExpectCTTestReport_Params_Data>(index_);
    }
    NetworkContext_SetExpectCTTestReport_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> report_uri;

 private:
  NetworkContext_SetExpectCTTestReport_Params_Data();
  ~NetworkContext_SetExpectCTTestReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetExpectCTTestReport_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetExpectCTTestReport_Params_Data)");
class  NetworkContext_SetExpectCTTestReport_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetExpectCTTestReport_ResponseParams_Data));
      new (data()) NetworkContext_SetExpectCTTestReport_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetExpectCTTestReport_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetExpectCTTestReport_ResponseParams_Data>(index_);
    }
    NetworkContext_SetExpectCTTestReport_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_SetExpectCTTestReport_ResponseParams_Data();
  ~NetworkContext_SetExpectCTTestReport_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetExpectCTTestReport_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_SetExpectCTTestReport_ResponseParams_Data)");
class  NetworkContext_GetExpectCTState_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetExpectCTState_Params_Data));
      new (data()) NetworkContext_GetExpectCTState_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetExpectCTState_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetExpectCTState_Params_Data>(index_);
    }
    NetworkContext_GetExpectCTState_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> domain;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;

 private:
  NetworkContext_GetExpectCTState_Params_Data();
  ~NetworkContext_GetExpectCTState_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetExpectCTState_Params_Data) == 24,
              "Bad sizeof(NetworkContext_GetExpectCTState_Params_Data)");
class  NetworkContext_GetExpectCTState_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetExpectCTState_ResponseParams_Data));
      new (data()) NetworkContext_GetExpectCTState_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetExpectCTState_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetExpectCTState_ResponseParams_Data>(index_);
    }
    NetworkContext_GetExpectCTState_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> state;

 private:
  NetworkContext_GetExpectCTState_ResponseParams_Data();
  ~NetworkContext_GetExpectCTState_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetExpectCTState_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_GetExpectCTState_ResponseParams_Data)");
class  NetworkContext_CreateUDPSocket_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateUDPSocket_Params_Data));
      new (data()) NetworkContext_CreateUDPSocket_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateUDPSocket_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateUDPSocket_Params_Data>(index_);
    }
    NetworkContext_CreateUDPSocket_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  mojo::internal::Interface_Data listener;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateUDPSocket_Params_Data();
  ~NetworkContext_CreateUDPSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateUDPSocket_Params_Data) == 24,
              "Bad sizeof(NetworkContext_CreateUDPSocket_Params_Data)");
class  NetworkContext_CreateTCPServerSocket_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPServerSocket_Params_Data));
      new (data()) NetworkContext_CreateTCPServerSocket_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPServerSocket_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPServerSocket_Params_Data>(index_);
    }
    NetworkContext_CreateTCPServerSocket_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
  uint32_t backlog;
  mojo::internal::Handle_Data socket;
  mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;

 private:
  NetworkContext_CreateTCPServerSocket_Params_Data();
  ~NetworkContext_CreateTCPServerSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPServerSocket_Params_Data) == 32,
              "Bad sizeof(NetworkContext_CreateTCPServerSocket_Params_Data)");
class  NetworkContext_CreateTCPServerSocket_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPServerSocket_ResponseParams_Data));
      new (data()) NetworkContext_CreateTCPServerSocket_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPServerSocket_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPServerSocket_ResponseParams_Data>(index_);
    }
    NetworkContext_CreateTCPServerSocket_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr_out;

 private:
  NetworkContext_CreateTCPServerSocket_ResponseParams_Data();
  ~NetworkContext_CreateTCPServerSocket_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPServerSocket_ResponseParams_Data) == 24,
              "Bad sizeof(NetworkContext_CreateTCPServerSocket_ResponseParams_Data)");
class  NetworkContext_CreateTCPConnectedSocket_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPConnectedSocket_Params_Data));
      new (data()) NetworkContext_CreateTCPConnectedSocket_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPConnectedSocket_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPConnectedSocket_Params_Data>(index_);
    }
    NetworkContext_CreateTCPConnectedSocket_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
  mojo::internal::Pointer<::network::mojom::internal::AddressList_Data> remote_addr_list;
  mojo::internal::Pointer<::network::mojom::internal::TCPConnectedSocketOptions_Data> tcp_connected_socket_options;
  mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
  mojo::internal::Handle_Data socket;
  mojo::internal::Interface_Data observer;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateTCPConnectedSocket_Params_Data();
  ~NetworkContext_CreateTCPConnectedSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPConnectedSocket_Params_Data) == 56,
              "Bad sizeof(NetworkContext_CreateTCPConnectedSocket_Params_Data)");
class  NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data));
      new (data()) NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data>(index_);
    }
    NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  mojo::internal::Handle_Data receive_stream;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> peer_addr;
  mojo::internal::Handle_Data send_stream;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data();
  ~NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data) == 40,
              "Bad sizeof(NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data)");
class  NetworkContext_CreateTCPBoundSocket_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPBoundSocket_Params_Data));
      new (data()) NetworkContext_CreateTCPBoundSocket_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPBoundSocket_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPBoundSocket_Params_Data>(index_);
    }
    NetworkContext_CreateTCPBoundSocket_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
  mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
  mojo::internal::Handle_Data socket;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateTCPBoundSocket_Params_Data();
  ~NetworkContext_CreateTCPBoundSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPBoundSocket_Params_Data) == 32,
              "Bad sizeof(NetworkContext_CreateTCPBoundSocket_Params_Data)");
class  NetworkContext_CreateTCPBoundSocket_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateTCPBoundSocket_ResponseParams_Data));
      new (data()) NetworkContext_CreateTCPBoundSocket_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateTCPBoundSocket_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateTCPBoundSocket_ResponseParams_Data>(index_);
    }
    NetworkContext_CreateTCPBoundSocket_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;

 private:
  NetworkContext_CreateTCPBoundSocket_ResponseParams_Data();
  ~NetworkContext_CreateTCPBoundSocket_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPBoundSocket_ResponseParams_Data) == 24,
              "Bad sizeof(NetworkContext_CreateTCPBoundSocket_ResponseParams_Data)");
class  NetworkContext_CreateProxyResolvingSocketFactory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateProxyResolvingSocketFactory_Params_Data));
      new (data()) NetworkContext_CreateProxyResolvingSocketFactory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateProxyResolvingSocketFactory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateProxyResolvingSocketFactory_Params_Data>(index_);
    }
    NetworkContext_CreateProxyResolvingSocketFactory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data factory;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateProxyResolvingSocketFactory_Params_Data();
  ~NetworkContext_CreateProxyResolvingSocketFactory_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateProxyResolvingSocketFactory_Params_Data) == 16,
              "Bad sizeof(NetworkContext_CreateProxyResolvingSocketFactory_Params_Data)");
class  NetworkContext_LookUpProxyForURL_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_LookUpProxyForURL_Params_Data));
      new (data()) NetworkContext_LookUpProxyForURL_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_LookUpProxyForURL_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_LookUpProxyForURL_Params_Data>(index_);
    }
    NetworkContext_LookUpProxyForURL_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;
  mojo::internal::Interface_Data proxy_lookup_client;

 private:
  NetworkContext_LookUpProxyForURL_Params_Data();
  ~NetworkContext_LookUpProxyForURL_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_LookUpProxyForURL_Params_Data) == 32,
              "Bad sizeof(NetworkContext_LookUpProxyForURL_Params_Data)");
class  NetworkContext_ForceReloadProxyConfig_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ForceReloadProxyConfig_Params_Data));
      new (data()) NetworkContext_ForceReloadProxyConfig_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ForceReloadProxyConfig_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ForceReloadProxyConfig_Params_Data>(index_);
    }
    NetworkContext_ForceReloadProxyConfig_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ForceReloadProxyConfig_Params_Data();
  ~NetworkContext_ForceReloadProxyConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceReloadProxyConfig_Params_Data) == 8,
              "Bad sizeof(NetworkContext_ForceReloadProxyConfig_Params_Data)");
class  NetworkContext_ForceReloadProxyConfig_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ForceReloadProxyConfig_ResponseParams_Data));
      new (data()) NetworkContext_ForceReloadProxyConfig_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ForceReloadProxyConfig_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ForceReloadProxyConfig_ResponseParams_Data>(index_);
    }
    NetworkContext_ForceReloadProxyConfig_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ForceReloadProxyConfig_ResponseParams_Data();
  ~NetworkContext_ForceReloadProxyConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceReloadProxyConfig_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ForceReloadProxyConfig_ResponseParams_Data)");
class  NetworkContext_ClearBadProxiesCache_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearBadProxiesCache_Params_Data));
      new (data()) NetworkContext_ClearBadProxiesCache_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearBadProxiesCache_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearBadProxiesCache_Params_Data>(index_);
    }
    NetworkContext_ClearBadProxiesCache_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearBadProxiesCache_Params_Data();
  ~NetworkContext_ClearBadProxiesCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearBadProxiesCache_Params_Data) == 8,
              "Bad sizeof(NetworkContext_ClearBadProxiesCache_Params_Data)");
class  NetworkContext_ClearBadProxiesCache_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ClearBadProxiesCache_ResponseParams_Data));
      new (data()) NetworkContext_ClearBadProxiesCache_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ClearBadProxiesCache_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ClearBadProxiesCache_ResponseParams_Data>(index_);
    }
    NetworkContext_ClearBadProxiesCache_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ClearBadProxiesCache_ResponseParams_Data();
  ~NetworkContext_ClearBadProxiesCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearBadProxiesCache_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ClearBadProxiesCache_ResponseParams_Data)");
class  NetworkContext_CreateWebSocket_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateWebSocket_Params_Data));
      new (data()) NetworkContext_CreateWebSocket_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateWebSocket_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateWebSocket_Params_Data>(index_);
    }
    NetworkContext_CreateWebSocket_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> requested_protocols;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::network::mojom::internal::IsolationInfo_Data> isolation_info;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpHeader_Data>>> additional_headers;
  int32_t process_id;
  int32_t render_frame_id;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
  uint32_t options;
  mojo::internal::Interface_Data handshake_client;
  mojo::internal::Interface_Data auth_handler;
  mojo::internal::Interface_Data header_client;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateWebSocket_Params_Data();
  ~NetworkContext_CreateWebSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateWebSocket_Params_Data) == 96,
              "Bad sizeof(NetworkContext_CreateWebSocket_Params_Data)");
class  NetworkContext_CreateQuicTransport_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateQuicTransport_Params_Data));
      new (data()) NetworkContext_CreateQuicTransport_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateQuicTransport_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateQuicTransport_Params_Data>(index_);
    }
    NetworkContext_CreateQuicTransport_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::QuicTransportCertificateFingerprint_Data>>> fingerprints;
  mojo::internal::Interface_Data handshake_client;

 private:
  NetworkContext_CreateQuicTransport_Params_Data();
  ~NetworkContext_CreateQuicTransport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateQuicTransport_Params_Data) == 48,
              "Bad sizeof(NetworkContext_CreateQuicTransport_Params_Data)");
class  NetworkContext_CreateNetLogExporter_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateNetLogExporter_Params_Data));
      new (data()) NetworkContext_CreateNetLogExporter_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateNetLogExporter_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateNetLogExporter_Params_Data>(index_);
    }
    NetworkContext_CreateNetLogExporter_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateNetLogExporter_Params_Data();
  ~NetworkContext_CreateNetLogExporter_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateNetLogExporter_Params_Data) == 16,
              "Bad sizeof(NetworkContext_CreateNetLogExporter_Params_Data)");
class  NetworkContext_PreconnectSockets_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_PreconnectSockets_Params_Data));
      new (data()) NetworkContext_PreconnectSockets_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_PreconnectSockets_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_PreconnectSockets_Params_Data>(index_);
    }
    NetworkContext_PreconnectSockets_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t num_streams;
  uint8_t allow_credentials : 1;
  uint8_t pad1_[3];
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;

 private:
  NetworkContext_PreconnectSockets_Params_Data();
  ~NetworkContext_PreconnectSockets_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_PreconnectSockets_Params_Data) == 32,
              "Bad sizeof(NetworkContext_PreconnectSockets_Params_Data)");
class  NetworkContext_CreateP2PSocketManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateP2PSocketManager_Params_Data));
      new (data()) NetworkContext_CreateP2PSocketManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateP2PSocketManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateP2PSocketManager_Params_Data>(index_);
    }
    NetworkContext_CreateP2PSocketManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;
  mojo::internal::Interface_Data client;
  mojo::internal::Handle_Data trusted_socket_manager;
  mojo::internal::Handle_Data socket_manager;

 private:
  NetworkContext_CreateP2PSocketManager_Params_Data();
  ~NetworkContext_CreateP2PSocketManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateP2PSocketManager_Params_Data) == 32,
              "Bad sizeof(NetworkContext_CreateP2PSocketManager_Params_Data)");
class  NetworkContext_CreateMdnsResponder_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateMdnsResponder_Params_Data));
      new (data()) NetworkContext_CreateMdnsResponder_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateMdnsResponder_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateMdnsResponder_Params_Data>(index_);
    }
    NetworkContext_CreateMdnsResponder_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data responder_receiver;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateMdnsResponder_Params_Data();
  ~NetworkContext_CreateMdnsResponder_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateMdnsResponder_Params_Data) == 16,
              "Bad sizeof(NetworkContext_CreateMdnsResponder_Params_Data)");
class  NetworkContext_ResolveHost_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ResolveHost_Params_Data));
      new (data()) NetworkContext_ResolveHost_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ResolveHost_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ResolveHost_Params_Data>(index_);
    }
    NetworkContext_ResolveHost_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> host;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;
  mojo::internal::Pointer<::network::mojom::internal::ResolveHostParameters_Data> optional_parameters;
  mojo::internal::Interface_Data response_client;

 private:
  NetworkContext_ResolveHost_Params_Data();
  ~NetworkContext_ResolveHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ResolveHost_Params_Data) == 40,
              "Bad sizeof(NetworkContext_ResolveHost_Params_Data)");
class  NetworkContext_CreateHostResolver_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_CreateHostResolver_Params_Data));
      new (data()) NetworkContext_CreateHostResolver_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_CreateHostResolver_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_CreateHostResolver_Params_Data>(index_);
    }
    NetworkContext_CreateHostResolver_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::DnsConfigOverrides_Data> config_overrides;
  mojo::internal::Handle_Data host_resolver;
  uint8_t padfinal_[4];

 private:
  NetworkContext_CreateHostResolver_Params_Data();
  ~NetworkContext_CreateHostResolver_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateHostResolver_Params_Data) == 24,
              "Bad sizeof(NetworkContext_CreateHostResolver_Params_Data)");
class  NetworkContext_VerifyCertForSignedExchange_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_VerifyCertForSignedExchange_Params_Data));
      new (data()) NetworkContext_VerifyCertForSignedExchange_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_VerifyCertForSignedExchange_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_VerifyCertForSignedExchange_Params_Data>(index_);
    }
    NetworkContext_VerifyCertForSignedExchange_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<mojo::internal::String_Data> ocsp_response;
  mojo::internal::Pointer<mojo::internal::String_Data> sct_list;

 private:
  NetworkContext_VerifyCertForSignedExchange_Params_Data();
  ~NetworkContext_VerifyCertForSignedExchange_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertForSignedExchange_Params_Data) == 40,
              "Bad sizeof(NetworkContext_VerifyCertForSignedExchange_Params_Data)");
class  NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data));
      new (data()) NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data>(index_);
    }
    NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error_code;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::network::mojom::internal::CertVerifyResult_Data> cv_result;
  mojo::internal::Pointer<::network::mojom::internal::CTVerifyResult_Data> ct_result;

 private:
  NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data();
  ~NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data) == 32,
              "Bad sizeof(NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data)");
class  NetworkContext_ParseHeaders_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ParseHeaders_Params_Data));
      new (data()) NetworkContext_ParseHeaders_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ParseHeaders_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ParseHeaders_Params_Data>(index_);
    }
    NetworkContext_ParseHeaders_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::HttpResponseHeaders_Data> headers;

 private:
  NetworkContext_ParseHeaders_Params_Data();
  ~NetworkContext_ParseHeaders_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ParseHeaders_Params_Data) == 24,
              "Bad sizeof(NetworkContext_ParseHeaders_Params_Data)");
class  NetworkContext_ParseHeaders_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ParseHeaders_ResponseParams_Data));
      new (data()) NetworkContext_ParseHeaders_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ParseHeaders_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ParseHeaders_ResponseParams_Data>(index_);
    }
    NetworkContext_ParseHeaders_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::ParsedHeaders_Data> parsed_headers;

 private:
  NetworkContext_ParseHeaders_ResponseParams_Data();
  ~NetworkContext_ParseHeaders_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ParseHeaders_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_ParseHeaders_ResponseParams_Data)");
class  NetworkContext_AddHSTS_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddHSTS_Params_Data));
      new (data()) NetworkContext_AddHSTS_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddHSTS_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddHSTS_Params_Data>(index_);
    }
    NetworkContext_AddHSTS_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> host;
  mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expiry;
  uint8_t include_subdomains : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_AddHSTS_Params_Data();
  ~NetworkContext_AddHSTS_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddHSTS_Params_Data) == 32,
              "Bad sizeof(NetworkContext_AddHSTS_Params_Data)");
class  NetworkContext_AddHSTS_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddHSTS_ResponseParams_Data));
      new (data()) NetworkContext_AddHSTS_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddHSTS_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddHSTS_ResponseParams_Data>(index_);
    }
    NetworkContext_AddHSTS_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_AddHSTS_ResponseParams_Data();
  ~NetworkContext_AddHSTS_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddHSTS_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_AddHSTS_ResponseParams_Data)");
class  NetworkContext_IsHSTSActiveForHost_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_IsHSTSActiveForHost_Params_Data));
      new (data()) NetworkContext_IsHSTSActiveForHost_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_IsHSTSActiveForHost_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_IsHSTSActiveForHost_Params_Data>(index_);
    }
    NetworkContext_IsHSTSActiveForHost_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> host;

 private:
  NetworkContext_IsHSTSActiveForHost_Params_Data();
  ~NetworkContext_IsHSTSActiveForHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_IsHSTSActiveForHost_Params_Data) == 16,
              "Bad sizeof(NetworkContext_IsHSTSActiveForHost_Params_Data)");
class  NetworkContext_IsHSTSActiveForHost_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_IsHSTSActiveForHost_ResponseParams_Data));
      new (data()) NetworkContext_IsHSTSActiveForHost_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_IsHSTSActiveForHost_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_IsHSTSActiveForHost_ResponseParams_Data>(index_);
    }
    NetworkContext_IsHSTSActiveForHost_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t result : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_IsHSTSActiveForHost_ResponseParams_Data();
  ~NetworkContext_IsHSTSActiveForHost_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_IsHSTSActiveForHost_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_IsHSTSActiveForHost_ResponseParams_Data)");
class  NetworkContext_GetHSTSState_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetHSTSState_Params_Data));
      new (data()) NetworkContext_GetHSTSState_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetHSTSState_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetHSTSState_Params_Data>(index_);
    }
    NetworkContext_GetHSTSState_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> domain;

 private:
  NetworkContext_GetHSTSState_Params_Data();
  ~NetworkContext_GetHSTSState_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetHSTSState_Params_Data) == 16,
              "Bad sizeof(NetworkContext_GetHSTSState_Params_Data)");
class  NetworkContext_GetHSTSState_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetHSTSState_ResponseParams_Data));
      new (data()) NetworkContext_GetHSTSState_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetHSTSState_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetHSTSState_ResponseParams_Data>(index_);
    }
    NetworkContext_GetHSTSState_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> state;

 private:
  NetworkContext_GetHSTSState_ResponseParams_Data();
  ~NetworkContext_GetHSTSState_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetHSTSState_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_GetHSTSState_ResponseParams_Data)");
class  NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data));
      new (data()) NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data>(index_);
    }
    NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> source_origin;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CorsOriginPattern_Data>>> allow_patterns;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CorsOriginPattern_Data>>> block_patterns;

 private:
  NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data();
  ~NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data) == 32,
              "Bad sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data)");
class  NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data));
      new (data()) NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data>(index_);
    }
    NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data();
  ~NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data)");
class  NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data));
      new (data()) NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data>(index_);
    }
    NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> cors_extra_safelisted_request_header_names;

 private:
  NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data();
  ~NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetCorsExtraSafelistedRequestHeaderNames_Params_Data)");
class  NetworkContext_DeleteDynamicDataForHost_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_DeleteDynamicDataForHost_Params_Data));
      new (data()) NetworkContext_DeleteDynamicDataForHost_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_DeleteDynamicDataForHost_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_DeleteDynamicDataForHost_Params_Data>(index_);
    }
    NetworkContext_DeleteDynamicDataForHost_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> host;

 private:
  NetworkContext_DeleteDynamicDataForHost_Params_Data();
  ~NetworkContext_DeleteDynamicDataForHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_DeleteDynamicDataForHost_Params_Data) == 16,
              "Bad sizeof(NetworkContext_DeleteDynamicDataForHost_Params_Data)");
class  NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data));
      new (data()) NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data>(index_);
    }
    NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t result : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data();
  ~NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data)");
class  NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data));
      new (data()) NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data>(index_);
    }
    NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t split_auth_cache_by_network_isolation_key : 1;
  uint8_t padfinal_[7];

 private:
  NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data();
  ~NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data) == 16,
              "Bad sizeof(NetworkContext_SetSplitAuthCacheByNetworkIsolationKey_Params_Data)");
class  NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data));
      new (data()) NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data>(index_);
    }
    NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data();
  ~NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data) == 8,
              "Bad sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data)");
class  NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data));
      new (data()) NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data>(index_);
    }
    NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cache_key;

 private:
  NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data();
  ~NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data)");
class  NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data));
      new (data()) NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data>(index_);
    }
    NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cache_key;

 private:
  NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data();
  ~NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data) == 16,
              "Bad sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data)");
class  NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data));
      new (data()) NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data>(index_);
    }
    NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data();
  ~NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data)");
class  NetworkContext_AddAuthCacheEntry_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddAuthCacheEntry_Params_Data));
      new (data()) NetworkContext_AddAuthCacheEntry_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddAuthCacheEntry_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddAuthCacheEntry_Params_Data>(index_);
    }
    NetworkContext_AddAuthCacheEntry_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::AuthChallengeInfo_Data> challenge;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;
  mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

 private:
  NetworkContext_AddAuthCacheEntry_Params_Data();
  ~NetworkContext_AddAuthCacheEntry_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddAuthCacheEntry_Params_Data) == 32,
              "Bad sizeof(NetworkContext_AddAuthCacheEntry_Params_Data)");
class  NetworkContext_AddAuthCacheEntry_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddAuthCacheEntry_ResponseParams_Data));
      new (data()) NetworkContext_AddAuthCacheEntry_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddAuthCacheEntry_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddAuthCacheEntry_ResponseParams_Data>(index_);
    }
    NetworkContext_AddAuthCacheEntry_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_AddAuthCacheEntry_ResponseParams_Data();
  ~NetworkContext_AddAuthCacheEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddAuthCacheEntry_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_AddAuthCacheEntry_ResponseParams_Data)");
class  NetworkContext_LookupServerBasicAuthCredentials_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_LookupServerBasicAuthCredentials_Params_Data));
      new (data()) NetworkContext_LookupServerBasicAuthCredentials_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_LookupServerBasicAuthCredentials_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_LookupServerBasicAuthCredentials_Params_Data>(index_);
    }
    NetworkContext_LookupServerBasicAuthCredentials_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::NetworkIsolationKey_Data> network_isolation_key;

 private:
  NetworkContext_LookupServerBasicAuthCredentials_Params_Data();
  ~NetworkContext_LookupServerBasicAuthCredentials_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_LookupServerBasicAuthCredentials_Params_Data) == 24,
              "Bad sizeof(NetworkContext_LookupServerBasicAuthCredentials_Params_Data)");
class  NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data));
      new (data()) NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data>(index_);
    }
    NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

 private:
  NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data();
  ~NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data)");
class  NetworkContext_EnableStaticKeyPinningForTesting_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_EnableStaticKeyPinningForTesting_Params_Data));
      new (data()) NetworkContext_EnableStaticKeyPinningForTesting_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_EnableStaticKeyPinningForTesting_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_EnableStaticKeyPinningForTesting_Params_Data>(index_);
    }
    NetworkContext_EnableStaticKeyPinningForTesting_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_EnableStaticKeyPinningForTesting_Params_Data();
  ~NetworkContext_EnableStaticKeyPinningForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_EnableStaticKeyPinningForTesting_Params_Data) == 8,
              "Bad sizeof(NetworkContext_EnableStaticKeyPinningForTesting_Params_Data)");
class  NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data));
      new (data()) NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data>(index_);
    }
    NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data();
  ~NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data)");
class  NetworkContext_VerifyCertificateForTesting_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_VerifyCertificateForTesting_Params_Data));
      new (data()) NetworkContext_VerifyCertificateForTesting_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_VerifyCertificateForTesting_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_VerifyCertificateForTesting_Params_Data>(index_);
    }
    NetworkContext_VerifyCertificateForTesting_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;
  mojo::internal::Pointer<mojo::internal::String_Data> hostname;
  mojo::internal::Pointer<mojo::internal::String_Data> ocsp_response;
  mojo::internal::Pointer<mojo::internal::String_Data> sct_list;

 private:
  NetworkContext_VerifyCertificateForTesting_Params_Data();
  ~NetworkContext_VerifyCertificateForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertificateForTesting_Params_Data) == 40,
              "Bad sizeof(NetworkContext_VerifyCertificateForTesting_Params_Data)");
class  NetworkContext_VerifyCertificateForTesting_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_VerifyCertificateForTesting_ResponseParams_Data));
      new (data()) NetworkContext_VerifyCertificateForTesting_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_VerifyCertificateForTesting_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_VerifyCertificateForTesting_ResponseParams_Data>(index_);
    }
    NetworkContext_VerifyCertificateForTesting_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error_code;
  uint8_t padfinal_[4];

 private:
  NetworkContext_VerifyCertificateForTesting_ResponseParams_Data();
  ~NetworkContext_VerifyCertificateForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertificateForTesting_ResponseParams_Data) == 16,
              "Bad sizeof(NetworkContext_VerifyCertificateForTesting_ResponseParams_Data)");
class  NetworkContext_AddDomainReliabilityContextForTesting_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_Params_Data));
      new (data()) NetworkContext_AddDomainReliabilityContextForTesting_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddDomainReliabilityContextForTesting_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddDomainReliabilityContextForTesting_Params_Data>(index_);
    }
    NetworkContext_AddDomainReliabilityContextForTesting_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> origin;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> upload_url;

 private:
  NetworkContext_AddDomainReliabilityContextForTesting_Params_Data();
  ~NetworkContext_AddDomainReliabilityContextForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_Params_Data) == 24,
              "Bad sizeof(NetworkContext_AddDomainReliabilityContextForTesting_Params_Data)");
class  NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data));
      new (data()) NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data>(index_);
    }
    NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data();
  ~NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data)");
class  NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data));
      new (data()) NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data>(index_);
    }
    NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data();
  ~NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data) == 8,
              "Bad sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data)");
class  NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data));
      new (data()) NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data>(index_);
    }
    NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data();
  ~NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data) == 8,
              "Bad sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data)");
class  NetworkContext_GetOriginPolicyManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NetworkContext_GetOriginPolicyManager_Params_Data));
      new (data()) NetworkContext_GetOriginPolicyManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NetworkContext_GetOriginPolicyManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NetworkContext_GetOriginPolicyManager_Params_Data>(index_);
    }
    NetworkContext_GetOriginPolicyManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data origin_policy_manager;
  uint8_t padfinal_[4];

 private:
  NetworkContext_GetOriginPolicyManager_Params_Data();
  ~NetworkContext_GetOriginPolicyManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetOriginPolicyManager_Params_Data) == 16,
              "Bad sizeof(NetworkContext_GetOriginPolicyManager_Params_Data)");

}  // namespace internal
class CustomProxyConfigClient_OnCustomProxyConfigUpdated_ParamsDataView {
 public:
  CustomProxyConfigClient_OnCustomProxyConfigUpdated_ParamsDataView() {}

  CustomProxyConfigClient_OnCustomProxyConfigUpdated_ParamsDataView(
      internal::CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetProxyConfigDataView(
      CustomProxyConfigDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadProxyConfig(UserType* output) {
    auto* pointer = data_->proxy_config.Get();
    return mojo::internal::Deserialize<::network::mojom::CustomProxyConfigDataView>(
        pointer, output, context_);
  }
 private:
