// services/network/public/mojom/quic_transport.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_QUIC_TRANSPORT_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_QUIC_TRANSPORT_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace network {
namespace mojom {
namespace internal {
class  QuicTransport_SendDatagram_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_SendDatagram_Params_Data));
      new (data()) QuicTransport_SendDatagram_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_SendDatagram_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_SendDatagram_Params_Data>(index_);
    }
    QuicTransport_SendDatagram_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

 private:
  QuicTransport_SendDatagram_Params_Data();
  ~QuicTransport_SendDatagram_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_SendDatagram_Params_Data) == 16,
              "Bad sizeof(QuicTransport_SendDatagram_Params_Data)");
class  QuicTransport_SendDatagram_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_SendDatagram_ResponseParams_Data));
      new (data()) QuicTransport_SendDatagram_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_SendDatagram_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_SendDatagram_ResponseParams_Data>(index_);
    }
    QuicTransport_SendDatagram_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t result : 1;
  uint8_t padfinal_[7];

 private:
  QuicTransport_SendDatagram_ResponseParams_Data();
  ~QuicTransport_SendDatagram_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuicTransport_SendDatagram_ResponseParams_Data) == 16,
              "Bad sizeof(QuicTransport_SendDatagram_ResponseParams_Data)");
class  QuicTransport_CreateStream_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_CreateStream_Params_Data));
      new (data()) QuicTransport_CreateStream_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_CreateStream_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_CreateStream_Params_Data>(index_);
    }
    QuicTransport_CreateStream_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data readable;
  mojo::internal::Handle_Data writable;

 private:
  QuicTransport_CreateStream_Params_Data();
  ~QuicTransport_CreateStream_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_CreateStream_Params_Data) == 16,
              "Bad sizeof(QuicTransport_CreateStream_Params_Data)");
class  QuicTransport_CreateStream_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_CreateStream_ResponseParams_Data));
      new (data()) QuicTransport_CreateStream_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_CreateStream_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_CreateStream_ResponseParams_Data>(index_);
    }
    QuicTransport_CreateStream_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t succeeded : 1;
  uint8_t pad0_[3];
  uint32_t stream_id;

 private:
  QuicTransport_CreateStream_ResponseParams_Data();
  ~QuicTransport_CreateStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuicTransport_CreateStream_ResponseParams_Data) == 16,
              "Bad sizeof(QuicTransport_CreateStream_ResponseParams_Data)");
class  QuicTransport_AcceptBidirectionalStream_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_AcceptBidirectionalStream_Params_Data));
      new (data()) QuicTransport_AcceptBidirectionalStream_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_AcceptBidirectionalStream_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_AcceptBidirectionalStream_Params_Data>(index_);
    }
    QuicTransport_AcceptBidirectionalStream_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  QuicTransport_AcceptBidirectionalStream_Params_Data();
  ~QuicTransport_AcceptBidirectionalStream_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_AcceptBidirectionalStream_Params_Data) == 8,
              "Bad sizeof(QuicTransport_AcceptBidirectionalStream_Params_Data)");
class  QuicTransport_AcceptBidirectionalStream_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_AcceptBidirectionalStream_ResponseParams_Data));
      new (data()) QuicTransport_AcceptBidirectionalStream_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_AcceptBidirectionalStream_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_AcceptBidirectionalStream_ResponseParams_Data>(index_);
    }
    QuicTransport_AcceptBidirectionalStream_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t stream_id;
  mojo::internal::Handle_Data readable;
  mojo::internal::Handle_Data writable;
  uint8_t padfinal_[4];

 private:
  QuicTransport_AcceptBidirectionalStream_ResponseParams_Data();
  ~QuicTransport_AcceptBidirectionalStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuicTransport_AcceptBidirectionalStream_ResponseParams_Data) == 24,
              "Bad sizeof(QuicTransport_AcceptBidirectionalStream_ResponseParams_Data)");
class  QuicTransport_AcceptUnidirectionalStream_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_AcceptUnidirectionalStream_Params_Data));
      new (data()) QuicTransport_AcceptUnidirectionalStream_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_AcceptUnidirectionalStream_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_AcceptUnidirectionalStream_Params_Data>(index_);
    }
    QuicTransport_AcceptUnidirectionalStream_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  QuicTransport_AcceptUnidirectionalStream_Params_Data();
  ~QuicTransport_AcceptUnidirectionalStream_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_AcceptUnidirectionalStream_Params_Data) == 8,
              "Bad sizeof(QuicTransport_AcceptUnidirectionalStream_Params_Data)");
class  QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data));
      new (data()) QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data>(index_);
    }
    QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t stream_id;
  mojo::internal::Handle_Data readable;

 private:
  QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data();
  ~QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data) == 16,
              "Bad sizeof(QuicTransport_AcceptUnidirectionalStream_ResponseParams_Data)");
class  QuicTransport_SendFin_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_SendFin_Params_Data));
      new (data()) QuicTransport_SendFin_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_SendFin_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_SendFin_Params_Data>(index_);
    }
    QuicTransport_SendFin_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t stream_id;
  uint8_t padfinal_[4];

 private:
  QuicTransport_SendFin_Params_Data();
  ~QuicTransport_SendFin_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_SendFin_Params_Data) == 16,
              "Bad sizeof(QuicTransport_SendFin_Params_Data)");
class  QuicTransport_AbortStream_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransport_AbortStream_Params_Data));
      new (data()) QuicTransport_AbortStream_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransport_AbortStream_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransport_AbortStream_Params_Data>(index_);
    }
    QuicTransport_AbortStream_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t stream_id;
  uint8_t pad0_[4];
  uint64_t code;

 private:
  QuicTransport_AbortStream_Params_Data();
  ~QuicTransport_AbortStream_Params_Data() = delete;
};
static_assert(sizeof(QuicTransport_AbortStream_Params_Data) == 24,
              "Bad sizeof(QuicTransport_AbortStream_Params_Data)");
class  QuicTransportClient_OnDatagramReceived_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransportClient_OnDatagramReceived_Params_Data));
      new (data()) QuicTransportClient_OnDatagramReceived_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransportClient_OnDatagramReceived_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransportClient_OnDatagramReceived_Params_Data>(index_);
    }
    QuicTransportClient_OnDatagramReceived_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

 private:
  QuicTransportClient_OnDatagramReceived_Params_Data();
  ~QuicTransportClient_OnDatagramReceived_Params_Data() = delete;
};
static_assert(sizeof(QuicTransportClient_OnDatagramReceived_Params_Data) == 16,
              "Bad sizeof(QuicTransportClient_OnDatagramReceived_Params_Data)");
class  QuicTransportClient_OnIncomingStreamClosed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransportClient_OnIncomingStreamClosed_Params_Data));
      new (data()) QuicTransportClient_OnIncomingStreamClosed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransportClient_OnIncomingStreamClosed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransportClient_OnIncomingStreamClosed_Params_Data>(index_);
    }
    QuicTransportClient_OnIncomingStreamClosed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t stream_id;
  uint8_t fin_received : 1;
  uint8_t padfinal_[3];

 private:
  QuicTransportClient_OnIncomingStreamClosed_Params_Data();
  ~QuicTransportClient_OnIncomingStreamClosed_Params_Data() = delete;
};
static_assert(sizeof(QuicTransportClient_OnIncomingStreamClosed_Params_Data) == 16,
              "Bad sizeof(QuicTransportClient_OnIncomingStreamClosed_Params_Data)");
class  QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data));
      new (data()) QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data>(index_);
    }
    QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data transport;
  mojo::internal::Handle_Data client;
  uint8_t padfinal_[4];

 private:
  QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data();
  ~QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data() = delete;
};
static_assert(sizeof(QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data) == 24,
              "Bad sizeof(QuicTransportHandshakeClient_OnConnectionEstablished_Params_Data)");
class  QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data));
      new (data()) QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data>(index_);
    }
    QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::QuicTransportError_Data> error;

 private:
  QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data();
  ~QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data() = delete;
};
static_assert(sizeof(QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data) == 16,
              "Bad sizeof(QuicTransportHandshakeClient_OnHandshakeFailed_Params_Data)");

}  // namespace internal
class QuicTransport_SendDatagram_ParamsDataView {
 public:
  QuicTransport_SendDatagram_ParamsDataView() {}

  QuicTransport_SendDatagram_ParamsDataView(
      internal::QuicTransport_SendDatagram_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetDataDataView(
      ::mojo_base::mojom::ReadOnlyBufferDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadData(UserType* output) {
    auto* pointer = data_->data.Get();
    return mojo::internal::Deserialize<::mojo_base::mojom::ReadOnlyBufferDataView>(
        pointer, output, context_);
  }
 private:
  internal::QuicTransport_SendDatagram_Params_Data* data_ = nullptr;
