// services/network/public/mojom/restricted_cookie_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace network {
namespace mojom {
namespace internal {
class  RestrictedCookieManager_GetAllForUrl_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_GetAllForUrl_Params_Data));
      new (data()) RestrictedCookieManager_GetAllForUrl_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_GetAllForUrl_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_GetAllForUrl_Params_Data>(index_);
    }
    RestrictedCookieManager_GetAllForUrl_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
  mojo::internal::Pointer<internal::CookieManagerGetOptions_Data> options;

 private:
  RestrictedCookieManager_GetAllForUrl_Params_Data();
  ~RestrictedCookieManager_GetAllForUrl_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetAllForUrl_Params_Data) == 40,
              "Bad sizeof(RestrictedCookieManager_GetAllForUrl_Params_Data)");
class  RestrictedCookieManager_GetAllForUrl_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_GetAllForUrl_ResponseParams_Data));
      new (data()) RestrictedCookieManager_GetAllForUrl_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_GetAllForUrl_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_GetAllForUrl_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_GetAllForUrl_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieWithAccessResult_Data>>> cookies;

 private:
  RestrictedCookieManager_GetAllForUrl_ResponseParams_Data();
  ~RestrictedCookieManager_GetAllForUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetAllForUrl_ResponseParams_Data) == 16,
              "Bad sizeof(RestrictedCookieManager_GetAllForUrl_ResponseParams_Data)");
class  RestrictedCookieManager_SetCanonicalCookie_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_SetCanonicalCookie_Params_Data));
      new (data()) RestrictedCookieManager_SetCanonicalCookie_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_SetCanonicalCookie_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_SetCanonicalCookie_Params_Data>(index_);
    }
    RestrictedCookieManager_SetCanonicalCookie_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::network::mojom::internal::CanonicalCookie_Data> cookie;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;

 private:
  RestrictedCookieManager_SetCanonicalCookie_Params_Data();
  ~RestrictedCookieManager_SetCanonicalCookie_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCanonicalCookie_Params_Data) == 40,
              "Bad sizeof(RestrictedCookieManager_SetCanonicalCookie_Params_Data)");
class  RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data));
      new (data()) RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data();
  ~RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data) == 16,
              "Bad sizeof(RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data)");
class  RestrictedCookieManager_AddChangeListener_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_AddChangeListener_Params_Data));
      new (data()) RestrictedCookieManager_AddChangeListener_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_AddChangeListener_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_AddChangeListener_Params_Data>(index_);
    }
    RestrictedCookieManager_AddChangeListener_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
  mojo::internal::Interface_Data listener;

 private:
  RestrictedCookieManager_AddChangeListener_Params_Data();
  ~RestrictedCookieManager_AddChangeListener_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_AddChangeListener_Params_Data) == 40,
              "Bad sizeof(RestrictedCookieManager_AddChangeListener_Params_Data)");
class  RestrictedCookieManager_AddChangeListener_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_AddChangeListener_ResponseParams_Data));
      new (data()) RestrictedCookieManager_AddChangeListener_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_AddChangeListener_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_AddChangeListener_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_AddChangeListener_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  RestrictedCookieManager_AddChangeListener_ResponseParams_Data();
  ~RestrictedCookieManager_AddChangeListener_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_AddChangeListener_ResponseParams_Data) == 8,
              "Bad sizeof(RestrictedCookieManager_AddChangeListener_ResponseParams_Data)");
class  RestrictedCookieManager_SetCookieFromString_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_SetCookieFromString_Params_Data));
      new (data()) RestrictedCookieManager_SetCookieFromString_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_SetCookieFromString_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_SetCookieFromString_Params_Data>(index_);
    }
    RestrictedCookieManager_SetCookieFromString_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
  mojo::internal::Pointer<mojo::internal::String_Data> cookie;

 private:
  RestrictedCookieManager_SetCookieFromString_Params_Data();
  ~RestrictedCookieManager_SetCookieFromString_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCookieFromString_Params_Data) == 40,
              "Bad sizeof(RestrictedCookieManager_SetCookieFromString_Params_Data)");
class  RestrictedCookieManager_SetCookieFromString_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_SetCookieFromString_ResponseParams_Data));
      new (data()) RestrictedCookieManager_SetCookieFromString_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_SetCookieFromString_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_SetCookieFromString_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_SetCookieFromString_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  RestrictedCookieManager_SetCookieFromString_ResponseParams_Data();
  ~RestrictedCookieManager_SetCookieFromString_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCookieFromString_ResponseParams_Data) == 8,
              "Bad sizeof(RestrictedCookieManager_SetCookieFromString_ResponseParams_Data)");
class  RestrictedCookieManager_GetCookiesString_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_GetCookiesString_Params_Data));
      new (data()) RestrictedCookieManager_GetCookiesString_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_GetCookiesString_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_GetCookiesString_Params_Data>(index_);
    }
    RestrictedCookieManager_GetCookiesString_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;

 private:
  RestrictedCookieManager_GetCookiesString_Params_Data();
  ~RestrictedCookieManager_GetCookiesString_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetCookiesString_Params_Data) == 32,
              "Bad sizeof(RestrictedCookieManager_GetCookiesString_Params_Data)");
class  RestrictedCookieManager_GetCookiesString_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_GetCookiesString_ResponseParams_Data));
      new (data()) RestrictedCookieManager_GetCookiesString_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_GetCookiesString_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_GetCookiesString_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_GetCookiesString_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> cookies;

 private:
  RestrictedCookieManager_GetCookiesString_ResponseParams_Data();
  ~RestrictedCookieManager_GetCookiesString_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetCookiesString_ResponseParams_Data) == 16,
              "Bad sizeof(RestrictedCookieManager_GetCookiesString_ResponseParams_Data)");
class  RestrictedCookieManager_CookiesEnabledFor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_CookiesEnabledFor_Params_Data));
      new (data()) RestrictedCookieManager_CookiesEnabledFor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_CookiesEnabledFor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_CookiesEnabledFor_Params_Data>(index_);
    }
    RestrictedCookieManager_CookiesEnabledFor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
  mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
  mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;

 private:
  RestrictedCookieManager_CookiesEnabledFor_Params_Data();
  ~RestrictedCookieManager_CookiesEnabledFor_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_CookiesEnabledFor_Params_Data) == 32,
              "Bad sizeof(RestrictedCookieManager_CookiesEnabledFor_Params_Data)");
class  RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data));
      new (data()) RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data>(index_);
    }
    RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t cookies_enabled : 1;
  uint8_t padfinal_[7];

 private:
  RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data();
  ~RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data) == 16,
              "Bad sizeof(RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data)");

}  // namespace internal
class RestrictedCookieManager_GetAllForUrl_ParamsDataView {
 public:
  RestrictedCookieManager_GetAllForUrl_ParamsDataView() {}

  RestrictedCookieManager_GetAllForUrl_ParamsDataView(
      internal::RestrictedCookieManager_GetAllForUrl_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetUrlDataView(
      ::url::mojom::UrlDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadUrl(UserType* output) {
    auto* pointer = data_->url.Get();
    return mojo::internal::Deserialize<::url::mojom::UrlDataView>(
        pointer, output, context_);
  }
  inline void GetSiteForCookiesDataView(
      ::network::mojom::SiteForCookiesDataView* output);

