// services/device/public/mojom/device_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_DEVICE_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_DEVICE_SERVICE_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace device {
namespace mojom {
namespace internal {
class  DeviceService_BindFingerprint_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindFingerprint_Params_Data));
      new (data()) DeviceService_BindFingerprint_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindFingerprint_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindFingerprint_Params_Data>(index_);
    }
    DeviceService_BindFingerprint_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindFingerprint_Params_Data();
  ~DeviceService_BindFingerprint_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindFingerprint_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindFingerprint_Params_Data)");
class  DeviceService_BindGeolocationConfig_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindGeolocationConfig_Params_Data));
      new (data()) DeviceService_BindGeolocationConfig_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindGeolocationConfig_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindGeolocationConfig_Params_Data>(index_);
    }
    DeviceService_BindGeolocationConfig_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindGeolocationConfig_Params_Data();
  ~DeviceService_BindGeolocationConfig_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindGeolocationConfig_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindGeolocationConfig_Params_Data)");
class  DeviceService_BindGeolocationContext_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindGeolocationContext_Params_Data));
      new (data()) DeviceService_BindGeolocationContext_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindGeolocationContext_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindGeolocationContext_Params_Data>(index_);
    }
    DeviceService_BindGeolocationContext_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindGeolocationContext_Params_Data();
  ~DeviceService_BindGeolocationContext_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindGeolocationContext_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindGeolocationContext_Params_Data)");
class  DeviceService_BindGeolocationControl_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindGeolocationControl_Params_Data));
      new (data()) DeviceService_BindGeolocationControl_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindGeolocationControl_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindGeolocationControl_Params_Data>(index_);
    }
    DeviceService_BindGeolocationControl_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindGeolocationControl_Params_Data();
  ~DeviceService_BindGeolocationControl_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindGeolocationControl_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindGeolocationControl_Params_Data)");
class  DeviceService_BindInputDeviceManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindInputDeviceManager_Params_Data));
      new (data()) DeviceService_BindInputDeviceManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindInputDeviceManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindInputDeviceManager_Params_Data>(index_);
    }
    DeviceService_BindInputDeviceManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindInputDeviceManager_Params_Data();
  ~DeviceService_BindInputDeviceManager_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindInputDeviceManager_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindInputDeviceManager_Params_Data)");
class  DeviceService_BindBatteryMonitor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindBatteryMonitor_Params_Data));
      new (data()) DeviceService_BindBatteryMonitor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindBatteryMonitor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindBatteryMonitor_Params_Data>(index_);
    }
    DeviceService_BindBatteryMonitor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindBatteryMonitor_Params_Data();
  ~DeviceService_BindBatteryMonitor_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindBatteryMonitor_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindBatteryMonitor_Params_Data)");
class  DeviceService_BindNFCProvider_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindNFCProvider_Params_Data));
      new (data()) DeviceService_BindNFCProvider_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindNFCProvider_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindNFCProvider_Params_Data>(index_);
    }
    DeviceService_BindNFCProvider_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindNFCProvider_Params_Data();
  ~DeviceService_BindNFCProvider_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindNFCProvider_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindNFCProvider_Params_Data)");
class  DeviceService_BindVibrationManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindVibrationManager_Params_Data));
      new (data()) DeviceService_BindVibrationManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindVibrationManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindVibrationManager_Params_Data>(index_);
    }
    DeviceService_BindVibrationManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindVibrationManager_Params_Data();
  ~DeviceService_BindVibrationManager_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindVibrationManager_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindVibrationManager_Params_Data)");
class  DeviceService_BindHidManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindHidManager_Params_Data));
      new (data()) DeviceService_BindHidManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindHidManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindHidManager_Params_Data>(index_);
    }
    DeviceService_BindHidManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindHidManager_Params_Data();
  ~DeviceService_BindHidManager_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindHidManager_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindHidManager_Params_Data)");
class  DeviceService_BindPowerMonitor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindPowerMonitor_Params_Data));
      new (data()) DeviceService_BindPowerMonitor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindPowerMonitor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindPowerMonitor_Params_Data>(index_);
    }
    DeviceService_BindPowerMonitor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindPowerMonitor_Params_Data();
  ~DeviceService_BindPowerMonitor_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindPowerMonitor_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindPowerMonitor_Params_Data)");
class  DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data));
      new (data()) DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data>(index_);
    }
    DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data();
  ~DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindPublicIpAddressGeolocationProvider_Params_Data)");
class  DeviceService_BindScreenOrientationListener_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindScreenOrientationListener_Params_Data));
      new (data()) DeviceService_BindScreenOrientationListener_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindScreenOrientationListener_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindScreenOrientationListener_Params_Data>(index_);
    }
    DeviceService_BindScreenOrientationListener_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindScreenOrientationListener_Params_Data();
  ~DeviceService_BindScreenOrientationListener_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindScreenOrientationListener_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindScreenOrientationListener_Params_Data)");
class  DeviceService_BindSensorProvider_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindSensorProvider_Params_Data));
      new (data()) DeviceService_BindSensorProvider_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindSensorProvider_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindSensorProvider_Params_Data>(index_);
    }
    DeviceService_BindSensorProvider_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindSensorProvider_Params_Data();
  ~DeviceService_BindSensorProvider_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindSensorProvider_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindSensorProvider_Params_Data)");
class  DeviceService_BindSerialPortManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindSerialPortManager_Params_Data));
      new (data()) DeviceService_BindSerialPortManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindSerialPortManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindSerialPortManager_Params_Data>(index_);
    }
    DeviceService_BindSerialPortManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindSerialPortManager_Params_Data();
  ~DeviceService_BindSerialPortManager_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindSerialPortManager_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindSerialPortManager_Params_Data)");
class  DeviceService_BindTimeZoneMonitor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindTimeZoneMonitor_Params_Data));
      new (data()) DeviceService_BindTimeZoneMonitor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindTimeZoneMonitor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindTimeZoneMonitor_Params_Data>(index_);
    }
    DeviceService_BindTimeZoneMonitor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindTimeZoneMonitor_Params_Data();
  ~DeviceService_BindTimeZoneMonitor_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindTimeZoneMonitor_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindTimeZoneMonitor_Params_Data)");
class  DeviceService_BindWakeLockProvider_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindWakeLockProvider_Params_Data));
      new (data()) DeviceService_BindWakeLockProvider_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindWakeLockProvider_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindWakeLockProvider_Params_Data>(index_);
    }
    DeviceService_BindWakeLockProvider_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindWakeLockProvider_Params_Data();
  ~DeviceService_BindWakeLockProvider_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindWakeLockProvider_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindWakeLockProvider_Params_Data)");
class  DeviceService_BindUsbDeviceManager_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindUsbDeviceManager_Params_Data));
      new (data()) DeviceService_BindUsbDeviceManager_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindUsbDeviceManager_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindUsbDeviceManager_Params_Data>(index_);
    }
    DeviceService_BindUsbDeviceManager_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindUsbDeviceManager_Params_Data();
  ~DeviceService_BindUsbDeviceManager_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindUsbDeviceManager_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindUsbDeviceManager_Params_Data)");
class  DeviceService_BindUsbDeviceManagerTest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(DeviceService_BindUsbDeviceManagerTest_Params_Data));
      new (data()) DeviceService_BindUsbDeviceManagerTest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    DeviceService_BindUsbDeviceManagerTest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<DeviceService_BindUsbDeviceManagerTest_Params_Data>(index_);
    }
    DeviceService_BindUsbDeviceManagerTest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  DeviceService_BindUsbDeviceManagerTest_Params_Data();
  ~DeviceService_BindUsbDeviceManagerTest_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_BindUsbDeviceManagerTest_Params_Data) == 16,
              "Bad sizeof(DeviceService_BindUsbDeviceManagerTest_Params_Data)");

}  // namespace internal
class DeviceService_BindFingerprint_ParamsDataView {
 public:
  DeviceService_BindFingerprint_ParamsDataView() {}

  DeviceService_BindFingerprint_ParamsDataView(
      internal::DeviceService_BindFingerprint_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeReceiver() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::device::mojom::FingerprintInterfaceBase>>(
            &data_->receiver, &result, context_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::DeviceService_BindFingerprint_Params_Data* data_ = nullptr;
  mojo::internal::SerializationContext* context_ = nullptr;
};

