// components/services/storage/public/mojom/filesystem/directory.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_FILESYSTEM_DIRECTORY_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_FILESYSTEM_DIRECTORY_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace storage {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) FileLock_Release_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FileLock_Release_Params_Data));
      new (data()) FileLock_Release_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FileLock_Release_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FileLock_Release_Params_Data>(index_);
    }
    FileLock_Release_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  FileLock_Release_Params_Data();
  ~FileLock_Release_Params_Data() = delete;
};
static_assert(sizeof(FileLock_Release_Params_Data) == 8,
              "Bad sizeof(FileLock_Release_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) FileLock_Release_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FileLock_Release_ResponseParams_Data));
      new (data()) FileLock_Release_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FileLock_Release_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FileLock_Release_ResponseParams_Data>(index_);
    }
    FileLock_Release_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  uint8_t padfinal_[4];

 private:
  FileLock_Release_ResponseParams_Data();
  ~FileLock_Release_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileLock_Release_ResponseParams_Data) == 16,
              "Bad sizeof(FileLock_Release_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_Clone_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_Clone_Params_Data));
      new (data()) Directory_Clone_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_Clone_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_Clone_Params_Data>(index_);
    }
    Directory_Clone_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  Directory_Clone_Params_Data();
  ~Directory_Clone_Params_Data() = delete;
};
static_assert(sizeof(Directory_Clone_Params_Data) == 16,
              "Bad sizeof(Directory_Clone_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_PathExists_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_PathExists_Params_Data));
      new (data()) Directory_PathExists_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_PathExists_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_PathExists_Params_Data>(index_);
    }
    Directory_PathExists_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_PathExists_Params_Data();
  ~Directory_PathExists_Params_Data() = delete;
};
static_assert(sizeof(Directory_PathExists_Params_Data) == 16,
              "Bad sizeof(Directory_PathExists_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_PathExists_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_PathExists_ResponseParams_Data));
      new (data()) Directory_PathExists_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_PathExists_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_PathExists_ResponseParams_Data>(index_);
    }
    Directory_PathExists_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t exists : 1;
  uint8_t padfinal_[7];

 private:
  Directory_PathExists_ResponseParams_Data();
  ~Directory_PathExists_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_PathExists_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_PathExists_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetEntries_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_GetEntries_Params_Data));
      new (data()) Directory_GetEntries_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_GetEntries_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_GetEntries_Params_Data>(index_);
    }
    Directory_GetEntries_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;
  int32_t mode;
  uint8_t padfinal_[4];

 private:
  Directory_GetEntries_Params_Data();
  ~Directory_GetEntries_Params_Data() = delete;
};
static_assert(sizeof(Directory_GetEntries_Params_Data) == 24,
              "Bad sizeof(Directory_GetEntries_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetEntries_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_GetEntries_ResponseParams_Data));
      new (data()) Directory_GetEntries_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_GetEntries_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_GetEntries_ResponseParams_Data>(index_);
    }
    Directory_GetEntries_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> entries;

 private:
  Directory_GetEntries_ResponseParams_Data();
  ~Directory_GetEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_GetEntries_ResponseParams_Data) == 24,
              "Bad sizeof(Directory_GetEntries_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_OpenFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_OpenFile_Params_Data));
      new (data()) Directory_OpenFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_OpenFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_OpenFile_Params_Data>(index_);
    }
    Directory_OpenFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;
  int32_t mode;
  int32_t read_access;
  int32_t write_access;
  uint8_t padfinal_[4];

 private:
  Directory_OpenFile_Params_Data();
  ~Directory_OpenFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_OpenFile_Params_Data) == 32,
              "Bad sizeof(Directory_OpenFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_OpenFile_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_OpenFile_ResponseParams_Data));
      new (data()) Directory_OpenFile_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_OpenFile_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_OpenFile_ResponseParams_Data>(index_);
    }
    Directory_OpenFile_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;

 private:
  Directory_OpenFile_ResponseParams_Data();
  ~Directory_OpenFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_OpenFile_ResponseParams_Data) == 24,
              "Bad sizeof(Directory_OpenFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RemoveFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RemoveFile_Params_Data));
      new (data()) Directory_RemoveFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RemoveFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RemoveFile_Params_Data>(index_);
    }
    Directory_RemoveFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_RemoveFile_Params_Data();
  ~Directory_RemoveFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_RemoveFile_Params_Data) == 16,
              "Bad sizeof(Directory_RemoveFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RemoveFile_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RemoveFile_ResponseParams_Data));
      new (data()) Directory_RemoveFile_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RemoveFile_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RemoveFile_ResponseParams_Data>(index_);
    }
    Directory_RemoveFile_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  Directory_RemoveFile_ResponseParams_Data();
  ~Directory_RemoveFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_RemoveFile_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_RemoveFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_CreateDirectory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_CreateDirectory_Params_Data));
      new (data()) Directory_CreateDirectory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_CreateDirectory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_CreateDirectory_Params_Data>(index_);
    }
    Directory_CreateDirectory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_CreateDirectory_Params_Data();
  ~Directory_CreateDirectory_Params_Data() = delete;
};
static_assert(sizeof(Directory_CreateDirectory_Params_Data) == 16,
              "Bad sizeof(Directory_CreateDirectory_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_CreateDirectory_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_CreateDirectory_ResponseParams_Data));
      new (data()) Directory_CreateDirectory_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_CreateDirectory_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_CreateDirectory_ResponseParams_Data>(index_);
    }
    Directory_CreateDirectory_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  uint8_t padfinal_[4];

 private:
  Directory_CreateDirectory_ResponseParams_Data();
  ~Directory_CreateDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_CreateDirectory_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_CreateDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RemoveDirectory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RemoveDirectory_Params_Data));
      new (data()) Directory_RemoveDirectory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RemoveDirectory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RemoveDirectory_Params_Data>(index_);
    }
    Directory_RemoveDirectory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_RemoveDirectory_Params_Data();
  ~Directory_RemoveDirectory_Params_Data() = delete;
};
static_assert(sizeof(Directory_RemoveDirectory_Params_Data) == 16,
              "Bad sizeof(Directory_RemoveDirectory_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RemoveDirectory_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RemoveDirectory_ResponseParams_Data));
      new (data()) Directory_RemoveDirectory_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RemoveDirectory_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RemoveDirectory_ResponseParams_Data>(index_);
    }
    Directory_RemoveDirectory_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  Directory_RemoveDirectory_ResponseParams_Data();
  ~Directory_RemoveDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_RemoveDirectory_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_RemoveDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetFileInfo_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_GetFileInfo_Params_Data));
      new (data()) Directory_GetFileInfo_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_GetFileInfo_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_GetFileInfo_Params_Data>(index_);
    }
    Directory_GetFileInfo_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_GetFileInfo_Params_Data();
  ~Directory_GetFileInfo_Params_Data() = delete;
};
static_assert(sizeof(Directory_GetFileInfo_Params_Data) == 16,
              "Bad sizeof(Directory_GetFileInfo_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetFileInfo_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_GetFileInfo_ResponseParams_Data));
      new (data()) Directory_GetFileInfo_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_GetFileInfo_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_GetFileInfo_ResponseParams_Data>(index_);
    }
    Directory_GetFileInfo_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> info;

 private:
  Directory_GetFileInfo_ResponseParams_Data();
  ~Directory_GetFileInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_GetFileInfo_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_GetFileInfo_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RenameFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RenameFile_Params_Data));
      new (data()) Directory_RenameFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RenameFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RenameFile_Params_Data>(index_);
    }
    Directory_RenameFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> old_path;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> new_path;

 private:
  Directory_RenameFile_Params_Data();
  ~Directory_RenameFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_RenameFile_Params_Data) == 24,
              "Bad sizeof(Directory_RenameFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RenameFile_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_RenameFile_ResponseParams_Data));
      new (data()) Directory_RenameFile_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_RenameFile_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_RenameFile_ResponseParams_Data>(index_);
    }
    Directory_RenameFile_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  uint8_t padfinal_[4];

 private:
  Directory_RenameFile_ResponseParams_Data();
  ~Directory_RenameFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_RenameFile_ResponseParams_Data) == 16,
              "Bad sizeof(Directory_RenameFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_LockFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_LockFile_Params_Data));
      new (data()) Directory_LockFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_LockFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_LockFile_Params_Data>(index_);
    }
    Directory_LockFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

 private:
  Directory_LockFile_Params_Data();
  ~Directory_LockFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_LockFile_Params_Data) == 16,
              "Bad sizeof(Directory_LockFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_LockFile_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(Directory_LockFile_ResponseParams_Data));
      new (data()) Directory_LockFile_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    Directory_LockFile_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<Directory_LockFile_ResponseParams_Data>(index_);
    }
    Directory_LockFile_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t error;
  mojo::internal::Interface_Data lock;
  uint8_t padfinal_[4];

 private:
  Directory_LockFile_ResponseParams_Data();
  ~Directory_LockFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_LockFile_ResponseParams_Data) == 24,
              "Bad sizeof(Directory_LockFile_ResponseParams_Data)");

}  // namespace internal
class FileLock_Release_ParamsDataView {
 public:
  FileLock_Release_ParamsDataView() {}

  FileLock_Release_ParamsDataView(
      internal::FileLock_Release_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::FileLock_Release_Params_Data* data_ = nullptr;
};

class FileLock_Release_ResponseParamsDataView {
 public:
  FileLock_Release_ResponseParamsDataView() {}

  FileLock_Release_ResponseParamsDataView(
      internal::FileLock_Release_ResponseParams_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadError(UserType* output) const {
    auto data_value = data_->error;
