// components/autofill/content/common/mojom/autofill_driver.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_DRIVER_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_DRIVER_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace autofill {
namespace mojom {
namespace internal {
class  AutofillDriver_FormsSeen_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_FormsSeen_Params_Data));
      new (data()) AutofillDriver_FormsSeen_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_FormsSeen_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_FormsSeen_Params_Data>(index_);
    }
    AutofillDriver_FormsSeen_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> forms;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;

 private:
  AutofillDriver_FormsSeen_Params_Data();
  ~AutofillDriver_FormsSeen_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FormsSeen_Params_Data) == 24,
              "Bad sizeof(AutofillDriver_FormsSeen_Params_Data)");
class  AutofillDriver_FormSubmitted_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_FormSubmitted_Params_Data));
      new (data()) AutofillDriver_FormSubmitted_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_FormSubmitted_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_FormSubmitted_Params_Data>(index_);
    }
    AutofillDriver_FormSubmitted_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  uint8_t known_success : 1;
  uint8_t pad1_[3];
  int32_t source;

 private:
  AutofillDriver_FormSubmitted_Params_Data();
  ~AutofillDriver_FormSubmitted_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FormSubmitted_Params_Data) == 24,
              "Bad sizeof(AutofillDriver_FormSubmitted_Params_Data)");
class  AutofillDriver_TextFieldDidChange_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_TextFieldDidChange_Params_Data));
      new (data()) AutofillDriver_TextFieldDidChange_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_TextFieldDidChange_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_TextFieldDidChange_Params_Data>(index_);
    }
    AutofillDriver_TextFieldDidChange_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounding_box;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;

 private:
  AutofillDriver_TextFieldDidChange_Params_Data();
  ~AutofillDriver_TextFieldDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_TextFieldDidChange_Params_Data) == 40,
              "Bad sizeof(AutofillDriver_TextFieldDidChange_Params_Data)");
class  AutofillDriver_TextFieldDidScroll_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_TextFieldDidScroll_Params_Data));
      new (data()) AutofillDriver_TextFieldDidScroll_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_TextFieldDidScroll_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_TextFieldDidScroll_Params_Data>(index_);
    }
    AutofillDriver_TextFieldDidScroll_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounding_box;

 private:
  AutofillDriver_TextFieldDidScroll_Params_Data();
  ~AutofillDriver_TextFieldDidScroll_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_TextFieldDidScroll_Params_Data) == 32,
              "Bad sizeof(AutofillDriver_TextFieldDidScroll_Params_Data)");
class  AutofillDriver_SelectControlDidChange_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_SelectControlDidChange_Params_Data));
      new (data()) AutofillDriver_SelectControlDidChange_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_SelectControlDidChange_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_SelectControlDidChange_Params_Data>(index_);
    }
    AutofillDriver_SelectControlDidChange_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounding_box;

 private:
  AutofillDriver_SelectControlDidChange_Params_Data();
  ~AutofillDriver_SelectControlDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_SelectControlDidChange_Params_Data) == 32,
              "Bad sizeof(AutofillDriver_SelectControlDidChange_Params_Data)");
class  AutofillDriver_SelectFieldOptionsDidChange_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_SelectFieldOptionsDidChange_Params_Data));
      new (data()) AutofillDriver_SelectFieldOptionsDidChange_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_SelectFieldOptionsDidChange_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_SelectFieldOptionsDidChange_Params_Data>(index_);
    }
    AutofillDriver_SelectFieldOptionsDidChange_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;

 private:
  AutofillDriver_SelectFieldOptionsDidChange_Params_Data();
  ~AutofillDriver_SelectFieldOptionsDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_SelectFieldOptionsDidChange_Params_Data) == 16,
              "Bad sizeof(AutofillDriver_SelectFieldOptionsDidChange_Params_Data)");
class  AutofillDriver_QueryFormFieldAutofill_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_QueryFormFieldAutofill_Params_Data));
      new (data()) AutofillDriver_QueryFormFieldAutofill_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_QueryFormFieldAutofill_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_QueryFormFieldAutofill_Params_Data>(index_);
    }
    AutofillDriver_QueryFormFieldAutofill_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t id;
  uint8_t autoselect_first_suggestion : 1;
  uint8_t pad1_[3];
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounding_box;

 private:
  AutofillDriver_QueryFormFieldAutofill_Params_Data();
  ~AutofillDriver_QueryFormFieldAutofill_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_QueryFormFieldAutofill_Params_Data) == 40,
              "Bad sizeof(AutofillDriver_QueryFormFieldAutofill_Params_Data)");
class  AutofillDriver_HidePopup_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_HidePopup_Params_Data));
      new (data()) AutofillDriver_HidePopup_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_HidePopup_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_HidePopup_Params_Data>(index_);
    }
    AutofillDriver_HidePopup_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  AutofillDriver_HidePopup_Params_Data();
  ~AutofillDriver_HidePopup_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_HidePopup_Params_Data) == 8,
              "Bad sizeof(AutofillDriver_HidePopup_Params_Data)");
class  AutofillDriver_FocusNoLongerOnForm_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_FocusNoLongerOnForm_Params_Data));
      new (data()) AutofillDriver_FocusNoLongerOnForm_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_FocusNoLongerOnForm_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_FocusNoLongerOnForm_Params_Data>(index_);
    }
    AutofillDriver_FocusNoLongerOnForm_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  AutofillDriver_FocusNoLongerOnForm_Params_Data();
  ~AutofillDriver_FocusNoLongerOnForm_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FocusNoLongerOnForm_Params_Data) == 8,
              "Bad sizeof(AutofillDriver_FocusNoLongerOnForm_Params_Data)");
class  AutofillDriver_FocusOnFormField_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_FocusOnFormField_Params_Data));
      new (data()) AutofillDriver_FocusOnFormField_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_FocusOnFormField_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_FocusOnFormField_Params_Data>(index_);
    }
    AutofillDriver_FocusOnFormField_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_Data> field;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounding_box;

 private:
  AutofillDriver_FocusOnFormField_Params_Data();
  ~AutofillDriver_FocusOnFormField_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FocusOnFormField_Params_Data) == 32,
              "Bad sizeof(AutofillDriver_FocusOnFormField_Params_Data)");
class  AutofillDriver_DidFillAutofillFormData_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_DidFillAutofillFormData_Params_Data));
      new (data()) AutofillDriver_DidFillAutofillFormData_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_DidFillAutofillFormData_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_DidFillAutofillFormData_Params_Data>(index_);
    }
    AutofillDriver_DidFillAutofillFormData_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;

 private:
  AutofillDriver_DidFillAutofillFormData_Params_Data();
  ~AutofillDriver_DidFillAutofillFormData_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_DidFillAutofillFormData_Params_Data) == 24,
              "Bad sizeof(AutofillDriver_DidFillAutofillFormData_Params_Data)");
class  AutofillDriver_DidPreviewAutofillFormData_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_DidPreviewAutofillFormData_Params_Data));
      new (data()) AutofillDriver_DidPreviewAutofillFormData_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_DidPreviewAutofillFormData_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_DidPreviewAutofillFormData_Params_Data>(index_);
    }
    AutofillDriver_DidPreviewAutofillFormData_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  AutofillDriver_DidPreviewAutofillFormData_Params_Data();
  ~AutofillDriver_DidPreviewAutofillFormData_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_DidPreviewAutofillFormData_Params_Data) == 8,
              "Bad sizeof(AutofillDriver_DidPreviewAutofillFormData_Params_Data)");
class  AutofillDriver_DidEndTextFieldEditing_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(AutofillDriver_DidEndTextFieldEditing_Params_Data));
      new (data()) AutofillDriver_DidEndTextFieldEditing_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    AutofillDriver_DidEndTextFieldEditing_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<AutofillDriver_DidEndTextFieldEditing_Params_Data>(index_);
    }
    AutofillDriver_DidEndTextFieldEditing_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  AutofillDriver_DidEndTextFieldEditing_Params_Data();
  ~AutofillDriver_DidEndTextFieldEditing_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_DidEndTextFieldEditing_Params_Data) == 8,
              "Bad sizeof(AutofillDriver_DidEndTextFieldEditing_Params_Data)");
class  PasswordManagerDriver_PasswordFormsParsed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_PasswordFormsParsed_Params_Data));
      new (data()) PasswordManagerDriver_PasswordFormsParsed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_PasswordFormsParsed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_PasswordFormsParsed_Params_Data>(index_);
    }
    PasswordManagerDriver_PasswordFormsParsed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> forms_data;

 private:
  PasswordManagerDriver_PasswordFormsParsed_Params_Data();
  ~PasswordManagerDriver_PasswordFormsParsed_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormsParsed_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_PasswordFormsParsed_Params_Data)");
class  PasswordManagerDriver_PasswordFormsRendered_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_PasswordFormsRendered_Params_Data));
      new (data()) PasswordManagerDriver_PasswordFormsRendered_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_PasswordFormsRendered_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_PasswordFormsRendered_Params_Data>(index_);
    }
    PasswordManagerDriver_PasswordFormsRendered_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> visible_forms_data;
  uint8_t did_stop_loading : 1;
  uint8_t padfinal_[7];

 private:
  PasswordManagerDriver_PasswordFormsRendered_Params_Data();
  ~PasswordManagerDriver_PasswordFormsRendered_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormsRendered_Params_Data) == 24,
              "Bad sizeof(PasswordManagerDriver_PasswordFormsRendered_Params_Data)");
class  PasswordManagerDriver_PasswordFormSubmitted_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_PasswordFormSubmitted_Params_Data));
      new (data()) PasswordManagerDriver_PasswordFormSubmitted_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_PasswordFormSubmitted_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_PasswordFormSubmitted_Params_Data>(index_);
    }
    PasswordManagerDriver_PasswordFormSubmitted_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

 private:
  PasswordManagerDriver_PasswordFormSubmitted_Params_Data();
  ~PasswordManagerDriver_PasswordFormSubmitted_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormSubmitted_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_PasswordFormSubmitted_Params_Data)");
class  PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data));
      new (data()) PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data>(index_);
    }
    PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

 private:
  PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data();
  ~PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_ShowManualFallbackForSaving_Params_Data)");
class  PasswordManagerDriver_HideManualFallbackForSaving_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_HideManualFallbackForSaving_Params_Data));
      new (data()) PasswordManagerDriver_HideManualFallbackForSaving_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_HideManualFallbackForSaving_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_HideManualFallbackForSaving_Params_Data>(index_);
    }
    PasswordManagerDriver_HideManualFallbackForSaving_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordManagerDriver_HideManualFallbackForSaving_Params_Data();
  ~PasswordManagerDriver_HideManualFallbackForSaving_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_HideManualFallbackForSaving_Params_Data) == 8,
              "Bad sizeof(PasswordManagerDriver_HideManualFallbackForSaving_Params_Data)");
class  PasswordManagerDriver_SameDocumentNavigation_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_SameDocumentNavigation_Params_Data));
      new (data()) PasswordManagerDriver_SameDocumentNavigation_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_SameDocumentNavigation_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_SameDocumentNavigation_Params_Data>(index_);
    }
    PasswordManagerDriver_SameDocumentNavigation_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t submission_indication_event;
  uint8_t padfinal_[4];

 private:
  PasswordManagerDriver_SameDocumentNavigation_Params_Data();
  ~PasswordManagerDriver_SameDocumentNavigation_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_SameDocumentNavigation_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_SameDocumentNavigation_Params_Data)");
class  PasswordManagerDriver_RecordSavePasswordProgress_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_RecordSavePasswordProgress_Params_Data));
      new (data()) PasswordManagerDriver_RecordSavePasswordProgress_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_RecordSavePasswordProgress_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_RecordSavePasswordProgress_Params_Data>(index_);
    }
    PasswordManagerDriver_RecordSavePasswordProgress_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> log;

 private:
  PasswordManagerDriver_RecordSavePasswordProgress_Params_Data();
  ~PasswordManagerDriver_RecordSavePasswordProgress_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_RecordSavePasswordProgress_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_RecordSavePasswordProgress_Params_Data)");
class  PasswordManagerDriver_UserModifiedPasswordField_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_UserModifiedPasswordField_Params_Data));
      new (data()) PasswordManagerDriver_UserModifiedPasswordField_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_UserModifiedPasswordField_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_UserModifiedPasswordField_Params_Data>(index_);
    }
    PasswordManagerDriver_UserModifiedPasswordField_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordManagerDriver_UserModifiedPasswordField_Params_Data();
  ~PasswordManagerDriver_UserModifiedPasswordField_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_UserModifiedPasswordField_Params_Data) == 8,
              "Bad sizeof(PasswordManagerDriver_UserModifiedPasswordField_Params_Data)");
class  PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data));
      new (data()) PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data>(index_);
    }
    PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> renderer_id;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

 private:
  PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data();
  ~PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data) == 24,
              "Bad sizeof(PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data)");
class  PasswordManagerDriver_ShowPasswordSuggestions_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_ShowPasswordSuggestions_Params_Data));
      new (data()) PasswordManagerDriver_ShowPasswordSuggestions_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_ShowPasswordSuggestions_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_ShowPasswordSuggestions_Params_Data>(index_);
    }
    PasswordManagerDriver_ShowPasswordSuggestions_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t text_direction;
  int32_t options;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> typed_username;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounds;

 private:
  PasswordManagerDriver_ShowPasswordSuggestions_Params_Data();
  ~PasswordManagerDriver_ShowPasswordSuggestions_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_ShowPasswordSuggestions_Params_Data) == 32,
              "Bad sizeof(PasswordManagerDriver_ShowPasswordSuggestions_Params_Data)");
class  PasswordManagerDriver_ShowTouchToFill_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_ShowTouchToFill_Params_Data));
      new (data()) PasswordManagerDriver_ShowTouchToFill_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_ShowTouchToFill_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_ShowTouchToFill_Params_Data>(index_);
    }
    PasswordManagerDriver_ShowTouchToFill_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordManagerDriver_ShowTouchToFill_Params_Data();
  ~PasswordManagerDriver_ShowTouchToFill_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_ShowTouchToFill_Params_Data) == 8,
              "Bad sizeof(PasswordManagerDriver_ShowTouchToFill_Params_Data)");
class  PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data));
      new (data()) PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data>(index_);
    }
    PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> form_action;
  mojo::internal::Pointer<::url::mojom::internal::Url_Data> frame_url;

 private:
  PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data();
  ~PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data) == 24,
              "Bad sizeof(PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data)");
class  PasswordManagerDriver_FocusedInputChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_FocusedInputChanged_Params_Data));
      new (data()) PasswordManagerDriver_FocusedInputChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_FocusedInputChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_FocusedInputChanged_Params_Data>(index_);
    }
    PasswordManagerDriver_FocusedInputChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t focused_field_type;
  uint8_t padfinal_[4];

 private:
  PasswordManagerDriver_FocusedInputChanged_Params_Data();
  ~PasswordManagerDriver_FocusedInputChanged_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_FocusedInputChanged_Params_Data) == 16,
              "Bad sizeof(PasswordManagerDriver_FocusedInputChanged_Params_Data)");
class  PasswordManagerDriver_LogFirstFillingResult_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordManagerDriver_LogFirstFillingResult_Params_Data));
      new (data()) PasswordManagerDriver_LogFirstFillingResult_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordManagerDriver_LogFirstFillingResult_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordManagerDriver_LogFirstFillingResult_Params_Data>(index_);
    }
    PasswordManagerDriver_LogFirstFillingResult_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormRendererId_Data> form_renderer_id;
  int32_t result;
  uint8_t padfinal_[4];

 private:
  PasswordManagerDriver_LogFirstFillingResult_Params_Data();
  ~PasswordManagerDriver_LogFirstFillingResult_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_LogFirstFillingResult_Params_Data) == 24,
              "Bad sizeof(PasswordManagerDriver_LogFirstFillingResult_Params_Data)");
class  PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data));
      new (data()) PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data>(index_);
    }
    PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::PasswordGenerationUIData_Data> password_generation_ui_data;

 private:
  PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data();
  ~PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data) == 16,
              "Bad sizeof(PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data)");
class  PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data));
      new (data()) PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data>(index_);
    }
    PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounds;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;
  mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_renderer_id;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password_value;

 private:
  PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data();
  ~PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data) == 40,
              "Bad sizeof(PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data)");
class  PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data));
      new (data()) PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data>(index_);
    }
    PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data();
  ~PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data) == 8,
              "Bad sizeof(PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data)");
class  PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data));
      new (data()) PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data>(index_);
    }
    PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;
  mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password_value;

 private:
  PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data();
  ~PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data) == 24,
              "Bad sizeof(PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data)");
class  PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data));
      new (data()) PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data>(index_);
    }
    PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

 private:
  PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data();
  ~PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data) == 16,
              "Bad sizeof(PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data)");
class  PasswordGenerationDriver_FrameWasScrolled_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_FrameWasScrolled_Params_Data));
      new (data()) PasswordGenerationDriver_FrameWasScrolled_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_FrameWasScrolled_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_FrameWasScrolled_Params_Data>(index_);
    }
    PasswordGenerationDriver_FrameWasScrolled_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordGenerationDriver_FrameWasScrolled_Params_Data();
  ~PasswordGenerationDriver_FrameWasScrolled_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_FrameWasScrolled_Params_Data) == 8,
              "Bad sizeof(PasswordGenerationDriver_FrameWasScrolled_Params_Data)");
class  PasswordGenerationDriver_GenerationElementLostFocus_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PasswordGenerationDriver_GenerationElementLostFocus_Params_Data));
      new (data()) PasswordGenerationDriver_GenerationElementLostFocus_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PasswordGenerationDriver_GenerationElementLostFocus_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PasswordGenerationDriver_GenerationElementLostFocus_Params_Data>(index_);
    }
    PasswordGenerationDriver_GenerationElementLostFocus_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  PasswordGenerationDriver_GenerationElementLostFocus_Params_Data();
  ~PasswordGenerationDriver_GenerationElementLostFocus_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_GenerationElementLostFocus_Params_Data) == 8,
              "Bad sizeof(PasswordGenerationDriver_GenerationElementLostFocus_Params_Data)");

}  // namespace internal
class AutofillDriver_FormsSeen_ParamsDataView {
 public:
  AutofillDriver_FormsSeen_ParamsDataView() {}

  AutofillDriver_FormsSeen_ParamsDataView(
      internal::AutofillDriver_FormsSeen_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetFormsDataView(
      mojo::ArrayDataView<::autofill::mojom::FormDataDataView>* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadForms(UserType* output) {
    auto* pointer = data_->forms.Get();
    return mojo::internal::Deserialize<mojo::ArrayDataView<::autofill::mojom::FormDataDataView>>(
        pointer, output, context_);
  }
  inline void GetTimestampDataView(
