// third_party/blink/public/mojom/webauthn/virtual_authenticator.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBAUTHN_VIRTUAL_AUTHENTICATOR_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBAUTHN_VIRTUAL_AUTHENTICATOR_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif
namespace blink {
namespace test {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetUniqueId_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_GetUniqueId_Params_Data));
      new (data()) VirtualAuthenticator_GetUniqueId_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_GetUniqueId_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_GetUniqueId_Params_Data>(index_);
    }
    VirtualAuthenticator_GetUniqueId_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticator_GetUniqueId_Params_Data();
  ~VirtualAuthenticator_GetUniqueId_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetUniqueId_Params_Data) == 8,
              "Bad sizeof(VirtualAuthenticator_GetUniqueId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetUniqueId_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_GetUniqueId_ResponseParams_Data));
      new (data()) VirtualAuthenticator_GetUniqueId_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_GetUniqueId_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_GetUniqueId_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_GetUniqueId_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> id;

 private:
  VirtualAuthenticator_GetUniqueId_ResponseParams_Data();
  ~VirtualAuthenticator_GetUniqueId_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetUniqueId_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_GetUniqueId_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_AddRegistration_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_AddRegistration_Params_Data));
      new (data()) VirtualAuthenticator_AddRegistration_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_AddRegistration_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_AddRegistration_Params_Data>(index_);
    }
    VirtualAuthenticator_AddRegistration_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::RegisteredKey_Data> key;

 private:
  VirtualAuthenticator_AddRegistration_Params_Data();
  ~VirtualAuthenticator_AddRegistration_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_AddRegistration_Params_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_AddRegistration_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_AddRegistration_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_AddRegistration_ResponseParams_Data));
      new (data()) VirtualAuthenticator_AddRegistration_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_AddRegistration_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_AddRegistration_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_AddRegistration_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t added : 1;
  uint8_t padfinal_[7];

 private:
  VirtualAuthenticator_AddRegistration_ResponseParams_Data();
  ~VirtualAuthenticator_AddRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_AddRegistration_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_AddRegistration_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetRegistrations_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_GetRegistrations_Params_Data));
      new (data()) VirtualAuthenticator_GetRegistrations_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_GetRegistrations_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_GetRegistrations_Params_Data>(index_);
    }
    VirtualAuthenticator_GetRegistrations_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticator_GetRegistrations_Params_Data();
  ~VirtualAuthenticator_GetRegistrations_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetRegistrations_Params_Data) == 8,
              "Bad sizeof(VirtualAuthenticator_GetRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetRegistrations_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_GetRegistrations_ResponseParams_Data));
      new (data()) VirtualAuthenticator_GetRegistrations_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_GetRegistrations_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_GetRegistrations_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_GetRegistrations_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::RegisteredKey_Data>>> keys;

 private:
  VirtualAuthenticator_GetRegistrations_ResponseParams_Data();
  ~VirtualAuthenticator_GetRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetRegistrations_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_GetRegistrations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_RemoveRegistration_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_RemoveRegistration_Params_Data));
      new (data()) VirtualAuthenticator_RemoveRegistration_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_RemoveRegistration_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_RemoveRegistration_Params_Data>(index_);
    }
    VirtualAuthenticator_RemoveRegistration_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key_handle;

 private:
  VirtualAuthenticator_RemoveRegistration_Params_Data();
  ~VirtualAuthenticator_RemoveRegistration_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_RemoveRegistration_Params_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_RemoveRegistration_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_RemoveRegistration_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_RemoveRegistration_ResponseParams_Data));
      new (data()) VirtualAuthenticator_RemoveRegistration_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_RemoveRegistration_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_RemoveRegistration_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_RemoveRegistration_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t removed : 1;
  uint8_t padfinal_[7];

 private:
  VirtualAuthenticator_RemoveRegistration_ResponseParams_Data();
  ~VirtualAuthenticator_RemoveRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_RemoveRegistration_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_RemoveRegistration_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_ClearRegistrations_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_ClearRegistrations_Params_Data));
      new (data()) VirtualAuthenticator_ClearRegistrations_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_ClearRegistrations_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_ClearRegistrations_Params_Data>(index_);
    }
    VirtualAuthenticator_ClearRegistrations_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticator_ClearRegistrations_Params_Data();
  ~VirtualAuthenticator_ClearRegistrations_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_ClearRegistrations_Params_Data) == 8,
              "Bad sizeof(VirtualAuthenticator_ClearRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_ClearRegistrations_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_ClearRegistrations_ResponseParams_Data));
      new (data()) VirtualAuthenticator_ClearRegistrations_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_ClearRegistrations_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_ClearRegistrations_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_ClearRegistrations_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticator_ClearRegistrations_ResponseParams_Data();
  ~VirtualAuthenticator_ClearRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_ClearRegistrations_ResponseParams_Data) == 8,
              "Bad sizeof(VirtualAuthenticator_ClearRegistrations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetUserVerified_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_SetUserVerified_Params_Data));
      new (data()) VirtualAuthenticator_SetUserVerified_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_SetUserVerified_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_SetUserVerified_Params_Data>(index_);
    }
    VirtualAuthenticator_SetUserVerified_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t verified : 1;
  uint8_t padfinal_[7];

 private:
  VirtualAuthenticator_SetUserVerified_Params_Data();
  ~VirtualAuthenticator_SetUserVerified_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetUserVerified_Params_Data) == 16,
              "Bad sizeof(VirtualAuthenticator_SetUserVerified_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetUserVerified_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticator_SetUserVerified_ResponseParams_Data));
      new (data()) VirtualAuthenticator_SetUserVerified_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticator_SetUserVerified_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticator_SetUserVerified_ResponseParams_Data>(index_);
    }
    VirtualAuthenticator_SetUserVerified_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticator_SetUserVerified_ResponseParams_Data();
  ~VirtualAuthenticator_SetUserVerified_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetUserVerified_ResponseParams_Data) == 8,
              "Bad sizeof(VirtualAuthenticator_SetUserVerified_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_CreateAuthenticator_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_Params_Data));
      new (data()) VirtualAuthenticatorManager_CreateAuthenticator_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_CreateAuthenticator_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_CreateAuthenticator_Params_Data>(index_);
    }
    VirtualAuthenticatorManager_CreateAuthenticator_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::VirtualAuthenticatorOptions_Data> options;

 private:
  VirtualAuthenticatorManager_CreateAuthenticator_Params_Data();
  ~VirtualAuthenticatorManager_CreateAuthenticator_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_Params_Data) == 16,
              "Bad sizeof(VirtualAuthenticatorManager_CreateAuthenticator_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data));
      new (data()) VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data>(index_);
    }
    VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data authenticator;

 private:
  VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data();
  ~VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_GetAuthenticators_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_GetAuthenticators_Params_Data));
      new (data()) VirtualAuthenticatorManager_GetAuthenticators_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_GetAuthenticators_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_GetAuthenticators_Params_Data>(index_);
    }
    VirtualAuthenticatorManager_GetAuthenticators_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticatorManager_GetAuthenticators_Params_Data();
  ~VirtualAuthenticatorManager_GetAuthenticators_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_GetAuthenticators_Params_Data) == 8,
              "Bad sizeof(VirtualAuthenticatorManager_GetAuthenticators_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data));
      new (data()) VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data>(index_);
    }
    VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Interface_Data>> authenticators;

 private:
  VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data();
  ~VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data));
      new (data()) VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data>(index_);
    }
    VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> id;

 private:
  VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data();
  ~VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data) == 16,
              "Bad sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data));
      new (data()) VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data>(index_);
    }
    VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t removed : 1;
  uint8_t padfinal_[7];

 private:
  VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data();
  ~VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data) == 16,
              "Bad sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_ClearAuthenticators_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_Params_Data));
      new (data()) VirtualAuthenticatorManager_ClearAuthenticators_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_ClearAuthenticators_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_ClearAuthenticators_Params_Data>(index_);
    }
    VirtualAuthenticatorManager_ClearAuthenticators_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticatorManager_ClearAuthenticators_Params_Data();
  ~VirtualAuthenticatorManager_ClearAuthenticators_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_Params_Data) == 8,
              "Bad sizeof(VirtualAuthenticatorManager_ClearAuthenticators_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data));
      new (data()) VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data>(index_);
    }
    VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data();
  ~VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data) == 8,
              "Bad sizeof(VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data)");

}  // namespace internal
class VirtualAuthenticator_GetUniqueId_ParamsDataView {
 public:
  VirtualAuthenticator_GetUniqueId_ParamsDataView() {}

  VirtualAuthenticator_GetUniqueId_ParamsDataView(
      internal::VirtualAuthenticator_GetUniqueId_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data) {}

  bool is_null() const { return !data_; }
 private:
  internal::VirtualAuthenticator_GetUniqueId_Params_Data* data_ = nullptr;
};

class VirtualAuthenticator_GetUniqueId_ResponseParamsDataView {
 public:
  VirtualAuthenticator_GetUniqueId_ResponseParamsDataView() {}

  VirtualAuthenticator_GetUniqueId_ResponseParamsDataView(
      internal::VirtualAuthenticator_GetUniqueId_ResponseParams_Data* data,
      mojo::internal::SerializationContext* context)
